src/blogs.org
#+title: An Amateur Programmer's Blogs
#+keywords: 海南省临高县电信局临时工

[[file:index.org][全部文件索引]]

** 2023
- 202301 [[file:management-behaviour-in-chinese-way.org][中国式管理行为 - 结语]] 曾仕强
- 202301 [[file:prune-sensitive-data-from-github.org][Github上删除敏感信息]]
- 202301 [[file:the-five-minute-rule-1997.org][The Five Minute Rule 1997]] @ 1997
- 202301 [[file:the-five-minute-rule-1987.org][The Five Minute Rule 1987]] @ 1987
- 202301 [[file:fsst-fast-random-access-string-compression.org][FSST: Fast Random Access String Compression]] @ 2020
- 202301 [[file:stack-overflow-the-architecture-2016-edition.org][Stack Overflow: The Architecture - 2016 Edition]]
- 202301 [[file:best-practices-for-using-the-jni.org][Best practices for using the Java Native Interface]]
- 202301 [[file:ebpf-rethinking-the-linux-kernel.org][eBPF - Rethinking the Linux Kernel]]

