html/blogs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Amateur Programmer's Blogs</title>
<meta name="author" content="dirtysalt" />
<meta name="keywords" content="海南省临高县电信局临时工" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">An Amateur Programmer's Blogs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgde0b27d">1. 2023</a></li>
<li><a href="#orgf31d683">2. 2022</a></li>
<li><a href="#org3638546">3. 2021</a></li>
<li><a href="#org658e18c">4. 2020</a></li>
<li><a href="#org0c95038">5. 2019</a></li>
<li><a href="#org64d71a1">6. 2018</a></li>
<li><a href="#org362c999">7. 2017</a></li>
<li><a href="#orgf78ed6d">8. 2016</a></li>
<li><a href="#org925c75c">9. 2015</a></li>
<li><a href="#orgbf81b90">10. &lt;2015</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">全部文件索引</a>
</p>

<div id="outline-container-orgde0b27d" class="outline-2">
<h2 id="orgde0b27d"><span class="section-number-2">1.</span> 2023</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>202301 <a href="management-behaviour-in-chinese-way.html">中国式管理行为 - 结语</a> 曾仕强</li>
<li>202301 <a href="prune-sensitive-data-from-github.html">Github上删除敏感信息</a></li>
<li>202301 <a href="the-five-minute-rule-1997.html">The Five Minute Rule 1997</a> @ 1997</li>
<li>202301 <a href="the-five-minute-rule-1987.html">The Five Minute Rule 1987</a> @ 1987</li>
<li>202301 <a href="fsst-fast-random-access-string-compression.html">FSST: Fast Random Access String Compression</a> @ 2020</li>
<li>202301 <a href="stack-overflow-the-architecture-2016-edition.html">Stack Overflow: The Architecture - 2016 Edition</a></li>
<li>202301 <a href="best-practices-for-using-the-jni.html">Best practices for using the Java Native Interface</a></li>
<li>202301 <a href="ebpf-rethinking-the-linux-kernel.html">eBPF - Rethinking the Linux Kernel</a></li>
</ul>
</div>
</div>
