src/blogs.org
** 2022
- 202212 [[file:inside-look-at-modern-web-browser.org][Inside look at modern web browser]] @ 2018
- 202212 [[file:filter-range-optimization.org][filter range实现优化]]
- 202211 [[file:data-structure-size-and-cache-line-accesses.org][Data structure size and cache-line accesses]]
- 202211 [[file:thinking-clearly-about-performance.org][Thinking Clearly about Performance]] by Cary Millsap
- 202211 [[file:wisdom-in-yijing.org][易经的奥秘]] cctv 曾仕强
- 202211 [[file:simple-memcpy-perf-comparison.org][一个简单的几种memcpy实现的性能测试对比]]
- 202211 [[file:simple-benchmark-on-jemalloc-and-tcmalloc.org][一个简单的tcmalloc/jemalloc性能测试对比]]
- 202211 [[file:use-chrome-trace-viewe-to-observe-schedule.org][使用Chrome Trace Viewer来观察调度]]
- 202210 [[file:rob-pike-5-rules-of-programming.org][Rob Pike's 5 Rules of Programming]]
- 202210 [[file:computing-performance-2021-whats-on-the-horizon.org][Computing Performance 2021 What's On the Horizon]]
- 202210 [[file:jit-compiling-sql-queries-in-pgsql-using-llvm.org][JIT-Compiling SQL Queries in PostgreSQL Using LLVM]]
- 202210 [[file:instruction-set-wants-to-be-free-riscv-case.org][Instruction Sets Want To Be Free: A Case for RISC-V]]
- 202210 [[file:how-did-you-learn-so-much-stuff.org][How did you learn so much stuff about Oracle?]] by Cary Millsap
- 202210 [[file:leetcode-hhrc-2022.org][LeetCode 数字经济算法编程大赛 2022]]
- 202210 [[file:nju-ics-pa.org][南京大学 ICS-PA 总结]]
- 202210 [[file:optimize-fixed-length-binary-to-integer.org][优化定长二进制串到整数变换]]
- 202209 [[file:how-to-sign-extend.org][符号扩展的几种实现]]
- 202208 [[file:scylladb-new-io-scheduler-2021.org][ScyllaDB’s New IO Scheduler]] @ 2021
- 202208 [[file:designing-userspace-diskio-scheduler-scylladb-example.org][Designing a Userspace Disk I/O Scheduler for Modern Datastores: the ScyllaDB example]] @ 2016
- 202208 [[file:code-simplicity.org][Code Simplicity]] by Max Kanat-Alex
- 202208 [[file:memory-deep-dive-ddr4.org][MEMORY DEEP DIVE: DDR4 MEMORY]]
- 202208 [[file:memory-deep-dive-performance.org][MEMORY DEEP DIVE: OPTIMIZING FOR PERFORMANCE]]
- 202208 [[file:memory-deep-dive-bandwidth.org][MEMORY DEEP DIVE: MEMORY SUBSYSTEM BANDWIDTH]]
- 202208 [[file:memory-deep-dive-subsystem.org][MEMORY DEEP DIVE: MEMORY SUBSYSTEM ORGANISATION]]
- 202208 [[file:optimize-math-function-case.org][优化数学函数案例 - Speeding up atan2f by 50x]]
- 202208 [[file:fizzbuzz-optimzied-program.org][FizzBuzz程序优化]]
- 202208 [[file:building-a-career-in-technology.org][Building a Career in Technology]]
- 202208 [[file:optimize-linux-pipe-case.org][优化Linux Pipe案例分析]]
- 202207 [[file:numa-deep-dive-part4-local-memory-optimization.org][NUMA DEEP DIVE PART 4: LOCAL MEMORY OPTIMIZATION]]
- 202207 [[file:numa-deep-dive-part3-cache-coherency.org][NUMA DEEP DIVE PART 3: CACHE COHERENCY]]
- 202207 [[file:numa-deep-dive-part2-system-architecture.org][NUMA DEEP DIVE PART 2: SYSTEM ARCHITECTURE]]
- 202207 [[file:numa-deep-dive-part1-from-uma-to-numa.org][NUMA DEEP DIVE PART 1: FROM UMA TO NUMA]]
- 202207 [[file:wangdefeng-course-das-kapital.org][王德峰【重读资本论】]]
- 202206 [[file:introduction-to-http2.org][Introduction to HTTP/2]]
- 202206 [[file:relaxed-operator-fusion-for-in-memory-databases.org][Relaxed Operator Fusion for In-Memory Databases]] @ 2017
- 202206 [[file:inside-the-sql-server-query-optimizer.org][Inside the SQL Server Query Optimizer]] @ 2010
- 202206 [[file:facebook-cachelib-document-overview.org][Facebook CacheLib 文档调研]]
- 202206 [[file:what-more-8-bit-microcontrollers.org][为什么需要更多 8 位单片机?]]
- 202205 [[file:a-year-in-tokyo.org][东京一年]] by 蒋方舟
- 202205 [[file:42-things-I-learned-from-building-a-production-database.org][42 things I learned from building a production database]]
- 202205 [[file:data-processing-at-the-speed-of-100gbps-using-apache-crail.org][Data Processing at the Speed of 100 Gbps using Apache Crail]]
- 202205 [[file:monetdb-x100-hyper-pipelining-query-execution.org][MonetDB/X100: Hyper-Pipelining Query Execution]] @ 2005
- 202205 [[file:tinylfu-highly-efficient-cache-admission-policy.org][TinyLFU: A Highly Efficient Cache Admission Policy]] @ 2015
- 202205 [[file:main-memory-database-systems-an-overview.org][Main Memory Database Systems: An Overview]] @ 1991
- 202205 [[file:umbra-disk-based-system-with-in-memory-performance.org][Umbra: A Disk-Based System with In-Memory Performance]] @ 2020
- 202205 [[file:amazon-redshift-reinvented-paper.org][Amazon Redshift Re-invented]] @ 2022
- 202205 [[file:pushdowndb-accelerating-dbms-using-s3-computation.org][PushdownDB: Accelerating a DBMS using S3 Computation]] @ 2020
- 202205 [[file:pocket-elastic-ephemeral-storage-for-serverless-analytics.org][Pocket: Elastic Ephemeral Storage for Serverless Analytics]] @ 2018
- 202205 [[file:building-an-elastic-query-engine-on-disaggregated-storage.org][Building An Elastic Query Engine on Disaggregated Storage]] @ 2020
- 202205 [[file:flexpushdowndb-hybrid-pushdown-and-caching-in-cloud-dbms.org][FlexPushdownDB: Hybrid Pushdown and Caching in a Cloud DBMS]] @ 2021
- 202205 [[file:columnar-storage-optimization-and-caching-for-data-lakes.org][Columnar Storage Optimization and Caching for Data Lakes]] @ 2022
- 202205 [[file:garbage-collect-algorithm-and-implementation-book.org][垃圾回收的算法和实现]] by 中村成洋
- 202205 [[file:crystal-unified-cache-storage-system-for-analytical-databases.org][Crystal: A Unified Cache Storage System for Analytical Databases]] @ 2021
- 202205 [[file:using-apache-arrow-caltice-parquet-to-build-relational-cache.org][Using Apache Arrow, Calcite, and Parquet to Build a Relational Cache]]
- 202205 [[file:dremio-c3-effect.org][Dremio C3效果分析]]
- 202205 [[file:dremio-reflections-docs-summary.org][Dremio Reflections/Views文档说明]]
- 202205 [[file:barbarians-at-gateways.org][Barbarians at the Gateways]] by Jacob Loveless
- 202205 [[file:swar-explained-parsing-eight-digits.org][SWAR explained: parsing eight digits]]
- 202205 [[file:when-the-os-gets-in-the-way.org][When the OS gets in the way - Mark Price]]
- 202204 [[file:the-h2o-distributed-kv-algorithm.org][The H2O distributed K/V algorithm by Cliff Click]]
- 202204 [[file:crash-course-in-modern-hardware.org][A Crash Course in Modern Hardware by Cliff Click]]
- 202204 [[file:talking-to-c-programmers-about-cpp-dan-saks.org][CppCon 2016: Dan Saks “extern c: Talking to C Programmers about C++”]]
- 202204 [[file:algorithmica-compilation-profiling.org][Algorithmica Compilation & Profiling]]
- 202204 [[file:algorithmica-comp-arch-and-language.org][Algorithmica CompArch & Language]]
- 202204 [[file:algorithmica-ram-cpu-caches.org][Algorithmica RAM & CPU Caches]]
- 202204 [[file:algorithmica-simd.org][Algorithmica SIMD]]
- 202204 [[file:the-linux-scheduler-decade-of-wasted-cores.org][The Linux Scheduler: a Decade of Wasted Cores]] @ 2016
- 202204 [[file:f1-query-declarative-quqey-at-scale.org][F1 Query: Declarative Querying at Scale]] @ 2018
- 202204 [[file:arch-of-dbms.org][Architecture of a Database System]] @ 2007
- 202204 [[file:readings-dbms-fifth-edition.org][Readings in Database Systems, 5th Edition (2015)]]
- 202203 [[file:data-center-computers-modern-challenges-in-cpu-design.org][Data Center Computers: Modern Challenges in CPU Design]] @ 2015
- 202203 [[file:go-scheduler-talk-dmitry-vyukov.org][Go Scheduler: Implementing language with lightweight concurrency]] @ 2019
- 202203 [[file:high-cpu-utilization-by-log4j.org][log4j引起高CPU使用率的问题]]
- 202203 [[file:memory-ordering-in-modern-microprocessors.org][Memory Ordering in Modern Microprocessors]] by Paul E. McKenney @ 2005
- 202203 [[file:optimize-reading-small-stripe-orc-file.org][优化读取小Stripe的ORC文件]]
- 202203 [[file:delta-lake-paper.org][Delta Lake: High-Performance ACID Table Storage over Cloud Object Stores]] @ 2020
- 202203 [[file:bpf-performance-tools.org][BPF Performance Tools]] @ Brendan Gregg
- 202203 [[file:ucb-cloud-programming-simplified.org][Cloud Programming Simplified: A Berkeley View on Serverless Computing]] @ 2019
- 202202 [[file:chn-24-season-times.org][中国24节气]]
- 202202 [[file:install-compiled-bcc-bpftrace.org][编译和安装bcc/bpftrace]]
- 202202 [[file:1024-cores-lock-free-section.org][1024cores.net lock-free section]]
- 202202 [[file:wanming-war-declaration.org][晚明 - 檄文]]
- 202202 [[file:diff-lock-free-and-wait-free.org][Lock-Based/Lock-Free/Wait-Free之间区别]]
- 202202 [[file:presto-sql-on-everything.org][Presto: SQL on Everything]] @ 2019
- 202202 [[file:apache-calcite-paper.org][Apache Calcite: A Foundational Framework for Optimized Query Processing Over Heterogeneous Data Sources]] @ 2018
- 202202 [[file:rcu-for-non-kernel-programmers.org][CppCon 2017: Fedor Pikus “Read, Copy, Update, then what? RCU for non-kernel programmers”]] by Fedor Pikus
- 202202 [[file:branchless-programming-in-cpp.org][Branchless Programming in C++ - Fedor Pikus - CppCon 2021]] by Fedor Pikus
- 202202 [[file:cpp-atomics-basic-to-advanced.org][CppCon 2017: Fedor Pikus “C++ atomics, from basic to advanced. What do they really do?”]] by Fedor Pikus
- 202201 [[file:test-aliyun-network-capacity.org][阿里云带宽测试]]
- 202201 [[file:thriving-in-crowded-and-changing-world-cpp.org][现代C++白皮书(C++ 2006-2020)]]

