html/blogs.html

<div id="outline-container-orgf31d683" class="outline-2">
<h2 id="orgf31d683"><span class="section-number-2">2.</span> 2022</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>202212 <a href="inside-look-at-modern-web-browser.html">Inside look at modern web browser</a> @ 2018</li>
<li>202212 <a href="filter-range-optimization.html">filter range实现优化</a></li>
<li>202211 <a href="data-structure-size-and-cache-line-accesses.html">Data structure size and cache-line accesses</a></li>
<li>202211 <a href="thinking-clearly-about-performance.html">Thinking Clearly about Performance</a> by Cary Millsap</li>
<li>202211 <a href="wisdom-in-yijing.html">易经的奥秘</a> cctv 曾仕强</li>
<li>202211 <a href="simple-memcpy-perf-comparison.html">一个简单的几种memcpy实现的性能测试对比</a></li>
<li>202211 <a href="simple-benchmark-on-jemalloc-and-tcmalloc.html">一个简单的tcmalloc/jemalloc性能测试对比</a></li>
<li>202211 <a href="use-chrome-trace-viewe-to-observe-schedule.html">使用Chrome Trace Viewer来观察调度</a></li>
<li>202210 <a href="rob-pike-5-rules-of-programming.html">Rob Pike's 5 Rules of Programming</a></li>
<li>202210 <a href="computing-performance-2021-whats-on-the-horizon.html">Computing Performance 2021 What's On the Horizon</a></li>
<li>202210 <a href="jit-compiling-sql-queries-in-pgsql-using-llvm.html">JIT-Compiling SQL Queries in PostgreSQL Using LLVM</a></li>
<li>202210 <a href="instruction-set-wants-to-be-free-riscv-case.html">Instruction Sets Want To Be Free: A Case for RISC-V</a></li>
<li>202210 <a href="how-did-you-learn-so-much-stuff.html">How did you learn so much stuff about Oracle?</a> by Cary Millsap</li>
<li>202210 <a href="leetcode-hhrc-2022.html">LeetCode 数字经济算法编程大赛 2022</a></li>
<li>202210 <a href="nju-ics-pa.html">南京大学 ICS-PA 总结</a></li>
<li>202210 <a href="optimize-fixed-length-binary-to-integer.html">优化定长二进制串到整数变换</a></li>
<li>202209 <a href="how-to-sign-extend.html">符号扩展的几种实现</a></li>
<li>202208 <a href="scylladb-new-io-scheduler-2021.html">ScyllaDB’s New IO Scheduler</a> @ 2021</li>
<li>202208 <a href="designing-userspace-diskio-scheduler-scylladb-example.html">Designing a Userspace Disk I/O Scheduler for Modern Datastores: the ScyllaDB example</a> @ 2016</li>
<li>202208 <a href="code-simplicity.html">Code Simplicity</a> by Max Kanat-Alex</li>
<li>202208 <a href="memory-deep-dive-ddr4.html">MEMORY DEEP DIVE: DDR4 MEMORY</a></li>
<li>202208 <a href="memory-deep-dive-performance.html">MEMORY DEEP DIVE: OPTIMIZING FOR PERFORMANCE</a></li>
<li>202208 <a href="memory-deep-dive-bandwidth.html">MEMORY DEEP DIVE: MEMORY SUBSYSTEM BANDWIDTH</a></li>
<li>202208 <a href="memory-deep-dive-subsystem.html">MEMORY DEEP DIVE: MEMORY SUBSYSTEM ORGANISATION</a></li>
<li>202208 <a href="optimize-math-function-case.html">优化数学函数案例 - Speeding up atan2f by 50x</a></li>
<li>202208 <a href="fizzbuzz-optimzied-program.html">FizzBuzz程序优化</a></li>
<li>202208 <a href="building-a-career-in-technology.html">Building a Career in Technology</a></li>
<li>202208 <a href="optimize-linux-pipe-case.html">优化Linux Pipe案例分析</a></li>
<li>202207 <a href="numa-deep-dive-part4-local-memory-optimization.html">NUMA DEEP DIVE PART 4: LOCAL MEMORY OPTIMIZATION</a></li>
<li>202207 <a href="numa-deep-dive-part3-cache-coherency.html">NUMA DEEP DIVE PART 3: CACHE COHERENCY</a></li>
<li>202207 <a href="numa-deep-dive-part2-system-architecture.html">NUMA DEEP DIVE PART 2: SYSTEM ARCHITECTURE</a></li>
<li>202207 <a href="numa-deep-dive-part1-from-uma-to-numa.html">NUMA DEEP DIVE PART 1: FROM UMA TO NUMA</a></li>
<li>202207 <a href="wangdefeng-course-das-kapital.html">王德峰【重读资本论】</a></li>
<li>202206 <a href="introduction-to-http2.html">Introduction to HTTP/2</a></li>
<li>202206 <a href="relaxed-operator-fusion-for-in-memory-databases.html">Relaxed Operator Fusion for In-Memory Databases</a> @ 2017</li>
<li>202206 <a href="inside-the-sql-server-query-optimizer.html">Inside the SQL Server Query Optimizer</a> @ 2010</li>
<li>202206 <a href="facebook-cachelib-document-overview.html">Facebook CacheLib 文档调研</a></li>
<li>202206 <a href="what-more-8-bit-microcontrollers.html">为什么需要更多 8 位单片机?</a></li>
<li>202205 <a href="a-year-in-tokyo.html">东京一年</a> by 蒋方舟</li>
<li>202205 <a href="42-things-I-learned-from-building-a-production-database.html">42 things I learned from building a production database</a></li>
<li>202205 <a href="data-processing-at-the-speed-of-100gbps-using-apache-crail.html">Data Processing at the Speed of 100 Gbps using Apache Crail</a></li>
<li>202205 <a href="monetdb-x100-hyper-pipelining-query-execution.html">MonetDB/X100: Hyper-Pipelining Query Execution</a> @ 2005</li>
<li>202205 <a href="tinylfu-highly-efficient-cache-admission-policy.html">TinyLFU: A Highly Efficient Cache Admission Policy</a> @ 2015</li>
<li>202205 <a href="main-memory-database-systems-an-overview.html">Main Memory Database Systems: An Overview</a> @ 1991</li>
<li>202205 <a href="umbra-disk-based-system-with-in-memory-performance.html">Umbra: A Disk-Based System with In-Memory Performance</a> @ 2020</li>
<li>202205 <a href="amazon-redshift-reinvented-paper.html">Amazon Redshift Re-invented</a> @ 2022</li>
<li>202205 <a href="pushdowndb-accelerating-dbms-using-s3-computation.html">PushdownDB: Accelerating a DBMS using S3 Computation</a> @ 2020</li>
<li>202205 <a href="pocket-elastic-ephemeral-storage-for-serverless-analytics.html">Pocket: Elastic Ephemeral Storage for Serverless Analytics</a> @ 2018</li>
<li>202205 <a href="building-an-elastic-query-engine-on-disaggregated-storage.html">Building An Elastic Query Engine on Disaggregated Storage</a> @ 2020</li>
<li>202205 <a href="flexpushdowndb-hybrid-pushdown-and-caching-in-cloud-dbms.html">FlexPushdownDB: Hybrid Pushdown and Caching in a Cloud DBMS</a> @ 2021</li>
<li>202205 <a href="columnar-storage-optimization-and-caching-for-data-lakes.html">Columnar Storage Optimization and Caching for Data Lakes</a> @ 2022</li>
<li>202205 <a href="garbage-collect-algorithm-and-implementation-book.html">垃圾回收的算法和实现</a> by 中村成洋</li>
<li>202205 <a href="crystal-unified-cache-storage-system-for-analytical-databases.html">Crystal: A Unified Cache Storage System for Analytical Databases</a> @ 2021</li>
<li>202205 <a href="using-apache-arrow-caltice-parquet-to-build-relational-cache.html">Using Apache Arrow, Calcite, and Parquet to Build a Relational Cache</a></li>
<li>202205 <a href="dremio-c3-effect.html">Dremio C3效果分析</a></li>
<li>202205 <a href="dremio-reflections-docs-summary.html">Dremio Reflections/Views文档说明</a></li>
<li>202205 <a href="barbarians-at-gateways.html">Barbarians at the Gateways</a> by Jacob Loveless</li>
<li>202205 <a href="swar-explained-parsing-eight-digits.html">SWAR explained: parsing eight digits</a></li>
<li>202205 <a href="when-the-os-gets-in-the-way.html">When the OS gets in the way - Mark Price</a></li>
<li>202204 <a href="the-h2o-distributed-kv-algorithm.html">The H2O distributed K/V algorithm by Cliff Click</a></li>
<li>202204 <a href="crash-course-in-modern-hardware.html">A Crash Course in Modern Hardware by Cliff Click</a></li>
<li>202204 <a href="talking-to-c-programmers-about-cpp-dan-saks.html">CppCon 2016: Dan Saks “extern c: Talking to C Programmers about C++”</a></li>
<li>202204 <a href="algorithmica-compilation-profiling.html">Algorithmica Compilation &amp; Profiling</a></li>
<li>202204 <a href="algorithmica-comp-arch-and-language.html">Algorithmica CompArch &amp; Language</a></li>
<li>202204 <a href="algorithmica-ram-cpu-caches.html">Algorithmica RAM &amp; CPU Caches</a></li>
<li>202204 <a href="algorithmica-simd.html">Algorithmica SIMD</a></li>
<li>202204 <a href="the-linux-scheduler-decade-of-wasted-cores.html">The Linux Scheduler: a Decade of Wasted Cores</a> @ 2016</li>
<li>202204 <a href="f1-query-declarative-quqey-at-scale.html">F1 Query: Declarative Querying at Scale</a> @ 2018</li>
<li>202204 <a href="arch-of-dbms.html">Architecture of a Database System</a> @ 2007</li>
<li>202204 <a href="readings-dbms-fifth-edition.html">Readings in Database Systems, 5th Edition (2015)</a></li>
<li>202203 <a href="data-center-computers-modern-challenges-in-cpu-design.html">Data Center Computers: Modern Challenges in CPU Design</a> @ 2015</li>
<li>202203 <a href="go-scheduler-talk-dmitry-vyukov.html">Go Scheduler: Implementing language with lightweight concurrency</a> @ 2019</li>
<li>202203 <a href="high-cpu-utilization-by-log4j.html">log4j引起高CPU使用率的问题</a></li>
<li>202203 <a href="memory-ordering-in-modern-microprocessors.html">Memory Ordering in Modern Microprocessors</a> by Paul E. McKenney @ 2005</li>
<li>202203 <a href="optimize-reading-small-stripe-orc-file.html">优化读取小Stripe的ORC文件</a></li>
<li>202203 <a href="delta-lake-paper.html">Delta Lake: High-Performance ACID Table Storage over Cloud Object Stores</a> @ 2020</li>
<li>202203 <a href="bpf-performance-tools.html">BPF Performance Tools</a> @ Brendan Gregg</li>
<li>202203 <a href="ucb-cloud-programming-simplified.html">Cloud Programming Simplified: A Berkeley View on Serverless Computing</a> @ 2019</li>
<li>202202 <a href="chn-24-season-times.html">中国24节气</a></li>
<li>202202 <a href="install-compiled-bcc-bpftrace.html">编译和安装bcc/bpftrace</a></li>
<li>202202 <a href="1024-cores-lock-free-section.html">1024cores.net lock-free section</a></li>
<li>202202 <a href="wanming-war-declaration.html">晚明 - 檄文</a></li>
<li>202202 <a href="diff-lock-free-and-wait-free.html">Lock-Based/Lock-Free/Wait-Free之间区别</a></li>
<li>202202 <a href="presto-sql-on-everything.html">Presto: SQL on Everything</a> @ 2019</li>
<li>202202 <a href="apache-calcite-paper.html">Apache Calcite: A Foundational Framework for Optimized Query Processing Over Heterogeneous Data Sources</a> @ 2018</li>
<li>202202 <a href="rcu-for-non-kernel-programmers.html">CppCon 2017: Fedor Pikus “Read, Copy, Update, then what? RCU for non-kernel programmers”</a> by Fedor Pikus</li>
<li>202202 <a href="branchless-programming-in-cpp.html">Branchless Programming in C++ - Fedor Pikus - CppCon 2021</a> by Fedor Pikus</li>
<li>202202 <a href="cpp-atomics-basic-to-advanced.html">CppCon 2017: Fedor Pikus “C++ atomics, from basic to advanced. What do they really do?”</a> by Fedor Pikus</li>
<li>202201 <a href="test-aliyun-network-capacity.html">阿里云带宽测试</a></li>
<li>202201 <a href="thriving-in-crowded-and-changing-world-cpp.html">现代C++白皮书(C++ 2006-2020)</a></li>
</ul>
</div>
</div>
