src/blogs.org
** 2021
- 202112 [[file:apps-survive-on-bad-alloc.org][Examining applications that do not terminate on std::bad_alloc]]
- 202112 [[file:java-at-speed.org][Java at Speed]] by Gil Tene
- 202112 [[file:roaring-bitmap-ser-size-unstable.org][Roaring Bitmap 序列化长度变化分析]]
- 202112 [[file:how-not-to-measure-latency.org][How NOT to Measure Latency]] by Gil Tene
- 202112 [[file:performance-matters.org]["Performance Matters" by Emery Berger]]
- 202112 [[file:multicore-opt-notur-2009.org][Multicore Optimization NOTUR 2009]] by Philip Mucci
- 202112 [[file:understanding-compiler-optimization-in-llvm.org][Understanding Compiler Optimization in LLVM]]
- 202112 [[file:run-vtune-in-linux-remote-desktop.org][在Linux远程桌面里使用VTune]]
- 202112 [[file:lets-talk-locks.org][Let’s talk locks!]]
- 202111 [[file:patterns-in-confusing-explanations.org][Patterns in confusing explanations]]
- 202111 [[file:how-to-get-useful-answers-to-your-questions.org][How to get useful answers to your questions]]
- 202111 [[file:what-every-eng-should-know-biggest-contributor-to-happiness.org][What Every Engineer and Computer Scientist Should Know: The Biggest Contributor to Happiness]]
- 202111 [[file:back-fuzhou-take-care-aunt.org][回抚州带姑姑去看病]]
- 202111 [[file:disruptor-tech-paper.org][Disruptor Technical Paper]] @ 2011
- 202110 [[file:efficiently-compiling-efficient-query-plans-for-modern-hardware.org][Efficiently Compiling Efficient Query Plans for Modern Hardware]]
- 202110 [[file:lmax-arch-martin-fowler.org][The LMAX Architecture]] by Martin Fowler
- 202110 [[file:numa-an-overview.org][NUMA An Overview]] 关于NUMA的介绍性文章
- 202110 [[file:linker-and-loader.org][链接器与加载器(Beta2 / 20061107)]]
- 202110 [[file:rethink-virtual-function-call-cost.org][虚函数的额外开销]]
- 202110 [[file:mysterious-memcpy-assembly-code.org][一段奇怪的汇编代码]]
- 202110 [[file:lessons-learned-in-national-days-2021.org][国庆在家的讨论小节]]
- 202110 [[file:hashtable-perf-comparison.org][HashTable性能测试(CK/phmap/ska)]]
- 202109 [[file:top-down-microarch-analysis-method.org][Top-down Microarchitecture Analysis Method]] 分析CPU性能方法
- 202109 [[file:xor-filters-paper.org][Xor Filters: Faster and Smaller Than Bloom and Cuckoo]]
- 202109 [[file:cuckoo-filter-paper.org][Cuckoo Filter: Practically Better Than Bloom]] @ 2014
- 202109 [[file:ccc-x86-64.org][The 64 bit x86 C Calling Convention]]
- 202109 [[file:query-processing-opt-compressed-ht-and-ussr.org][Efficient Query Processing with Optimistically Compressed Hash Tables & Strings in the USSR]] @ 2020
- 202109 [[file:graphics-programming-black-book.org][Graphics Programming Black Book]] by Michael Abrash
- 202109 [[file:zen-of-assembly-language.org][Zen of Assembly Language]] by Michael Abrash
- 202109 [[file:hashmap-perf-comparison.org][各种HashMap的性能对比]]
- 202108 [[file:three-fundamental-flaws-of-simd.org][Three fundamental flaws of SIMD]]
- 202108 [[file:druid-a-real-time-analytical-data-store.org][Druid: A Real-time Analytical Data Store]] @ 2014
- 202108 [[file:the-secrets-of-ck-perf-opt.org][The Secrets of ClickHouse Performance Optimizations]]
- 202108 [[file:benefitting-pow-and-performance-sleep-loops.org][Benefitting Power and Performance Sleep Loops]] @ 2015 优化自旋锁
- 202108 [[file:jemalloc-paper.org][A Scalable Concurrent malloc(3) Implementation for FreeBSD]] jemalloc
- 202108 [[file:low-latency-compilation-of-sql-queries-to-machine-code.org][Low-Latency Compilation of SQL Queries to Machine Code]]
- 202108 [[../images/fast-sqrt-inv.pdf][快速平方根倒数(talk pdf)]]
- 202108 [[file:look-clojure-from-outsider.org][Clojure的外部性表现]]
- 202108 [[file:design-a-good-non-crypt-hash-func.org][设计良好的非加密Hash函数]]
- 202108 [[file:compute-number-of-digits-of-an-integer.org][计算整数长度]]
- 202108 [[file:the-next-phase-of-cloud-computing.org][The Next Phase of Cloud Computing]] @ 2021
- 202108 [[file:compilation-in-sqlserver-hekaton-engine.org][Compilation in the Microsoft SQL Server Hekaton Engine]] @ 2014
- 202108 [[file:using-block-prefetch-for-optimized-memory-performance.org][Using Block Prefetch for Optimized Memory Performance]] @ AMD 2001
- 202108 [[file:memory-allocation-impact-on-high-perf-query-processing.org][On the Impact of Memory Allocation on High-Performance Query Processing]] @ 2019
- 202107 [[file:the-vertica-analytic-database.org][The Vertica Analytic Database: C-Store 7 Years Later]]
- 202107 [[file:piccolo-builing-fast-distributed-programs-with-partitioned-tables.org][Piccolo: Building Fast, Distributed Programs with Partitioned Tables]] @ 2010
- 202106 [[file:compiled-and-vectorized-query-comparison.org][Everything You Always Wanted to Know About Compiled and Vectorized Queries But Were Afraid to Ask]] @ 2018
- 202106 [[file:column-stores-vs-row-stores-how-different.org][Column-Stores vs. Row-Stores: How Different Are They Really?]] 2008
- 202106 [[file:integrating-compression-and-execution-in-cstore.org][Integrating Compression and Execution in Column-Oriented Database Systems]] @ 2006
- 202106 [[file:cstore-paper.org][C-Store: A Column-oriented DBMS]] @ 2005
- 202106 [[file:counting-number-of-matching-chars-in-ascii-strings.org][两个ascii字符串中相同字符数量]]
- 202106 [[file:voltnisky-string-search.org][Voltnisky字符串搜索算法]]
- 202106 [[file:cache-hash-space-efficient-bloom-filters.org][Cache-, Hash- and Space-Efficient Bloom Filters]]
- 202106 [[file:notes-on-programming.org][Notes on Programming]] by Alexander Stepanov
- 202106 [[file:cmudb-logging-and-crash-recovery.org][CMU DB: Database Logging & Crash Recovery]]
- 202106 [[file:efficient-bit-unpacking.org][有效地进行bit-unpacking]]
- 202106 [[file:selection-and-scenario-of-compression-algorithm.org][关于压缩算法的选择和使用场景]]
- 202106 [[file:vocalno-extensible-parallel-query-system.org][Volcano - An Extensible and Parallel Query Evaluation System]] @ 1994
- 202106 [[file:google-borg-paper.org][Large-scale cluster management at Google with Borg]] (revisited) @ 2015
- 202105 [[file:albis-high-perf-file-format-for-big-data-sys.org][Albis: High-Performance File Format for Big Data Systems]] @ 2018
- 202105 [[file:cmudb-mvcc.org][CMU DB Multi-Version Concurrency Control]]
- 202105 [[file:better-bitmap-perf-with-roaring-bitmaps.org][Better bitmap performance with Roaring bitmaps]] @ 2014
- 202105 [[file:cmudb-concurrency-control-theory.org][CMU DB: Concurrency Control Theory]]
- 202105 [[file:orca-a-modular-query-optimizer.org][Orca: A Modular Query Optimizer Architecture for Big Data]] @ 2014
- 202105 [[file:automated-locality-opt-based-on-reuse-dist-of-string-ops.org][Automated Locality Optimization Based on the Reuse Distance of String Operations]] @ 2011
- 202105 [[file:push-vs-pull-based-loop-fusion-in-query-engines.org][Push vs. Pull-Based Loop Fusion in Query Engines]] @ 2016
- 202105 [[file:watch-memory-ordering-effect.org][观察Memory Ordering效果]]
- 202104 [[file:morsel-driven-parallelism-framework.org][Morsel-Driven Parallelism: A NUMA-Aware Query Evaluation Framework for the Many-Core Age]] @ 2014
- 202104 [[file:fast-memcmp-and-memcpy-simd.org][fast memcpy/memcmp中的SIMD]]
- 202104 [[file:cmudb-sort-agg-join.org][CMUDB: Sort + Agg + Join]]
- 202104 [[file:convert-array-int64-to-int8.org][int64数组转为int8数组的矢量化方式]]
- 202104 [[file:cmudb-index-concurrency-control.org][CMU DB: Index Concurrency Control]]
- 202104 [[file:cmudb-tree-indexes.org][CMU DB: Tree Indexes]]
- 202104 [[file:cmudb-hash-index.org][CMU DB: Hash Index]]
- 202104 [[file:firstday-ddb.org][DDB入职当天]]
- 202104 [[file:c-switch-table-in-asm.org][C语言switch表格跳转的汇编实现]]
- 202104 [[file:fast-inverse-sqrt-quake.org][快速平方根倒数(Fast Inverse Square Root)]]
- 202104 [[file:cmudb-buffer-pools.org][CMU DB: Buffer Pools]]
- 202103 [[file:cmudb-query-planning.org][CMU DB: Query Planning]]
- 202103 [[file:cmudb-database-storage.org][CMU DB: Database Storage]]
- 202103 [[file:cmudb-query-processing.org][CMU DB: Query Processing]]
- 202103 [[file:scaling-memcache-at-facebook.org][Scaling Memcache at Facebook]] by Facebook @ 2013
- 202103 [[file:spark-rdd-paper.org][Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing]] @ 2012
- 202103 [[file:bitcoin.org][Bitcoin: A Peer-to-Peer Electronic Cash System]] 比特币论文
- 202103 [[file:spark-sql-paper.org][Spark SQL: Relational Data Processing in Spark]] by Databricks @ 2015
- 202103 [[file:impala-paper.org][Impala: A Modern, Open-Source SQL Engine for Hadoop]] @ 2015
- 202103 [[file:dremel.org][Dremel: Interactive Analysis of Web-Scale Datasets]] @ 2010
- 202103 [[file:performance-at-top-after-moore-law.org][There’s plenty of room at the Top: What will drive computer performance after Moore’s law?]] @ 2020
- 202103 [[file:how-to-learn-in-systematic-way.org][《不可能的技艺》4：超人怎样学]] by 《精英日课》 万维钢
- 202103 [[file:youtube-procella.org][Procella: Unifying serving and analytical data at YouTube]] by Google @ 2019
- 202103 [[file:apache-kudu-paper.org][Kudu: Storage for Fast Analytics on Fast Data]] @ 2015
- 202103 [[file:google-mesa.org][Mesa: Geo-Replicated, Near Real-Time, Scalable Data Warehousing]] by Google @ 2014
- 202102 [[file:why-we-think-when-we-have-search-engine.org][搜索引擎很强大，还需要自己思考答案吗？]] by 吴军《硅谷来信》
- 202102 [[file:the-almanack-of-naval-ravikant.org][The Almanack of Naval Ravikant]]
- 202102 [[file:the-simplest-things-in-investment.org][投资中最简单的事]] by 邱国鹭
- 202102 [[file:perf-analysis-and-tuning-on-modern-cpus.org][Performance Analysis and Tuning on Modern CPUs]]
- 202102 [[file:doris-hash-index.org][Doris Hash Index 分析]]
- 202102 [[file:few-simd-code-snippets.org][SIMD代码片段分析]]
- 202101 [[file:beautiful-code.org][代码之美(Beautiful Code)]] by Grey Wilson
- 202101 [[file:few-blogs-of-elite-course.org][近期《精英日课》的几篇文章]] 关于苦，上瘾，代孕
- 202101 [[file:popcount-functions.org][几个PopCount的实现]]
- 202101 [[file:optimizing-software-in-cpp.org][Optimizing software in C++]] by Agner Fog
- 202101 [[file:matrix-transpose-cache-analysis.org][矩阵转置的cache分析]]
- 202101 [[file:dont-stay-for-too-long.org][不要在一点停留太久（关于交流，优化和挑战）]]
- 202101 [[file:one-hundred-years-of-solitude.org][百年孤独(Cien años de soledad)]] 加西亚马尔克斯 / 范晔
- 202101 [[file:certificate-transparency.org][Certificate Transparency]] 证书透明
- 202101 [[file:spanner.org][Spanner: Google's Globally-Distributed Database]] @ 2012
- 202101 [[file:cops-causal-consistency.org][Don’t Settle for Eventual: Scalable Causal Consistency for Wide-Area Storage with COPS]] @ 2011
- 202101 [[file:incorrect-self-eval.org][错误的自我评价]]
- 202101 [[file:short-termer-and-long-termer.org][短期主义者和长期主义者]] 万维刚《精英日课》
- 202101 [[file:a-man-for-all-markets.org][战胜一切市场的人(A Man for All Markest)]] 爱德华夏普自传
- 202101 [[file:from-running-to-life.org][从跑步想到生活]]

