html/blogs.html

<div id="outline-container-org3638546" class="outline-2">
<h2 id="org3638546"><span class="section-number-2">3.</span> 2021</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>202112 <a href="apps-survive-on-bad-alloc.html">Examining applications that do not terminate on std::bad_alloc</a></li>
<li>202112 <a href="java-at-speed.html">Java at Speed</a> by Gil Tene</li>
<li>202112 <a href="roaring-bitmap-ser-size-unstable.html">Roaring Bitmap 序列化长度变化分析</a></li>
<li>202112 <a href="how-not-to-measure-latency.html">How NOT to Measure Latency</a> by Gil Tene</li>
<li>202112 <a href="performance-matters.html">"Performance Matters" by Emery Berger</a></li>
<li>202112 <a href="multicore-opt-notur-2009.html">Multicore Optimization NOTUR 2009</a> by Philip Mucci</li>
<li>202112 <a href="understanding-compiler-optimization-in-llvm.html">Understanding Compiler Optimization in LLVM</a></li>
<li>202112 <a href="run-vtune-in-linux-remote-desktop.html">在Linux远程桌面里使用VTune</a></li>
<li>202112 <a href="lets-talk-locks.html">Let’s talk locks!</a></li>
<li>202111 <a href="patterns-in-confusing-explanations.html">Patterns in confusing explanations</a></li>
<li>202111 <a href="how-to-get-useful-answers-to-your-questions.html">How to get useful answers to your questions</a></li>
<li>202111 <a href="what-every-eng-should-know-biggest-contributor-to-happiness.html">What Every Engineer and Computer Scientist Should Know: The Biggest Contributor to Happiness</a></li>
<li>202111 <a href="back-fuzhou-take-care-aunt.html">回抚州带姑姑去看病</a></li>
<li>202111 <a href="disruptor-tech-paper.html">Disruptor Technical Paper</a> @ 2011</li>
<li>202110 <a href="efficiently-compiling-efficient-query-plans-for-modern-hardware.html">Efficiently Compiling Efficient Query Plans for Modern Hardware</a></li>
<li>202110 <a href="lmax-arch-martin-fowler.html">The LMAX Architecture</a> by Martin Fowler</li>
<li>202110 <a href="numa-an-overview.html">NUMA An Overview</a> 关于NUMA的介绍性文章</li>
<li>202110 <a href="linker-and-loader.html">链接器与加载器(Beta2 / 20061107)</a></li>
<li>202110 <a href="rethink-virtual-function-call-cost.html">虚函数的额外开销</a></li>
<li>202110 <a href="mysterious-memcpy-assembly-code.html">一段奇怪的汇编代码</a></li>
<li>202110 <a href="lessons-learned-in-national-days-2021.html">国庆在家的讨论小节</a></li>
<li>202110 <a href="hashtable-perf-comparison.html">HashTable性能测试(CK/phmap/ska)</a></li>
<li>202109 <a href="top-down-microarch-analysis-method.html">Top-down Microarchitecture Analysis Method</a> 分析CPU性能方法</li>
<li>202109 <a href="xor-filters-paper.html">Xor Filters: Faster and Smaller Than Bloom and Cuckoo</a></li>
<li>202109 <a href="cuckoo-filter-paper.html">Cuckoo Filter: Practically Better Than Bloom</a> @ 2014</li>
<li>202109 <a href="ccc-x86-64.html">The 64 bit x86 C Calling Convention</a></li>
<li>202109 <a href="query-processing-opt-compressed-ht-and-ussr.html">Efficient Query Processing with Optimistically Compressed Hash Tables &amp; Strings in the USSR</a> @ 2020</li>
<li>202109 <a href="graphics-programming-black-book.html">Graphics Programming Black Book</a> by Michael Abrash</li>
<li>202109 <a href="zen-of-assembly-language.html">Zen of Assembly Language</a> by Michael Abrash</li>
<li>202109 <a href="hashmap-perf-comparison.html">各种HashMap的性能对比</a></li>
<li>202108 <a href="three-fundamental-flaws-of-simd.html">Three fundamental flaws of SIMD</a></li>
<li>202108 <a href="druid-a-real-time-analytical-data-store.html">Druid: A Real-time Analytical Data Store</a> @ 2014</li>
<li>202108 <a href="the-secrets-of-ck-perf-opt.html">The Secrets of ClickHouse Performance Optimizations</a></li>
<li>202108 <a href="benefitting-pow-and-performance-sleep-loops.html">Benefitting Power and Performance Sleep Loops</a> @ 2015 优化自旋锁</li>
<li>202108 <a href="jemalloc-paper.html">A Scalable Concurrent malloc(3) Implementation for FreeBSD</a> jemalloc</li>
<li>202108 <a href="low-latency-compilation-of-sql-queries-to-machine-code.html">Low-Latency Compilation of SQL Queries to Machine Code</a></li>
<li>202108 <a href="../images/fast-sqrt-inv.pdf">快速平方根倒数(talk pdf)</a></li>
<li>202108 <a href="look-clojure-from-outsider.html">Clojure的外部性表现</a></li>
<li>202108 <a href="design-a-good-non-crypt-hash-func.html">设计良好的非加密Hash函数</a></li>
<li>202108 <a href="compute-number-of-digits-of-an-integer.html">计算整数长度</a></li>
<li>202108 <a href="the-next-phase-of-cloud-computing.html">The Next Phase of Cloud Computing</a> @ 2021</li>
<li>202108 <a href="compilation-in-sqlserver-hekaton-engine.html">Compilation in the Microsoft SQL Server Hekaton Engine</a> @ 2014</li>
<li>202108 <a href="using-block-prefetch-for-optimized-memory-performance.html">Using Block Prefetch for Optimized Memory Performance</a> @ AMD 2001</li>
<li>202108 <a href="memory-allocation-impact-on-high-perf-query-processing.html">On the Impact of Memory Allocation on High-Performance Query Processing</a> @ 2019</li>
<li>202107 <a href="the-vertica-analytic-database.html">The Vertica Analytic Database: C-Store 7 Years Later</a></li>
<li>202107 <a href="piccolo-builing-fast-distributed-programs-with-partitioned-tables.html">Piccolo: Building Fast, Distributed Programs with Partitioned Tables</a> @ 2010</li>
<li>202106 <a href="compiled-and-vectorized-query-comparison.html">Everything You Always Wanted to Know About Compiled and Vectorized Queries But Were Afraid to Ask</a> @ 2018</li>
<li>202106 <a href="column-stores-vs-row-stores-how-different.html">Column-Stores vs. Row-Stores: How Different Are They Really?</a> 2008</li>
<li>202106 <a href="integrating-compression-and-execution-in-cstore.html">Integrating Compression and Execution in Column-Oriented Database Systems</a> @ 2006</li>
<li>202106 <a href="cstore-paper.html">C-Store: A Column-oriented DBMS</a> @ 2005</li>
<li>202106 <a href="counting-number-of-matching-chars-in-ascii-strings.html">两个ascii字符串中相同字符数量</a></li>
<li>202106 <a href="voltnisky-string-search.html">Voltnisky字符串搜索算法</a></li>
<li>202106 <a href="cache-hash-space-efficient-bloom-filters.html">Cache-, Hash- and Space-Efficient Bloom Filters</a></li>
<li>202106 <a href="notes-on-programming.html">Notes on Programming</a> by Alexander Stepanov</li>
<li>202106 <a href="cmudb-logging-and-crash-recovery.html">CMU DB: Database Logging &amp; Crash Recovery</a></li>
<li>202106 <a href="efficient-bit-unpacking.html">有效地进行bit-unpacking</a></li>
<li>202106 <a href="selection-and-scenario-of-compression-algorithm.html">关于压缩算法的选择和使用场景</a></li>
<li>202106 <a href="vocalno-extensible-parallel-query-system.html">Volcano - An Extensible and Parallel Query Evaluation System</a> @ 1994</li>
<li>202106 <a href="google-borg-paper.html">Large-scale cluster management at Google with Borg</a> (revisited) @ 2015</li>
<li>202105 <a href="albis-high-perf-file-format-for-big-data-sys.html">Albis: High-Performance File Format for Big Data Systems</a> @ 2018</li>
<li>202105 <a href="cmudb-mvcc.html">CMU DB Multi-Version Concurrency Control</a></li>
<li>202105 <a href="better-bitmap-perf-with-roaring-bitmaps.html">Better bitmap performance with Roaring bitmaps</a> @ 2014</li>
<li>202105 <a href="cmudb-concurrency-control-theory.html">CMU DB: Concurrency Control Theory</a></li>
<li>202105 <a href="orca-a-modular-query-optimizer.html">Orca: A Modular Query Optimizer Architecture for Big Data</a> @ 2014</li>
<li>202105 <a href="automated-locality-opt-based-on-reuse-dist-of-string-ops.html">Automated Locality Optimization Based on the Reuse Distance of String Operations</a> @ 2011</li>
<li>202105 <a href="push-vs-pull-based-loop-fusion-in-query-engines.html">Push vs. Pull-Based Loop Fusion in Query Engines</a> @ 2016</li>
<li>202105 <a href="watch-memory-ordering-effect.html">观察Memory Ordering效果</a></li>
<li>202104 <a href="morsel-driven-parallelism-framework.html">Morsel-Driven Parallelism: A NUMA-Aware Query Evaluation Framework for the Many-Core Age</a> @ 2014</li>
<li>202104 <a href="fast-memcmp-and-memcpy-simd.html">fast memcpy/memcmp中的SIMD</a></li>
<li>202104 <a href="cmudb-sort-agg-join.html">CMUDB: Sort + Agg + Join</a></li>
<li>202104 <a href="convert-array-int64-to-int8.html">int64数组转为int8数组的矢量化方式</a></li>
<li>202104 <a href="cmudb-index-concurrency-control.html">CMU DB: Index Concurrency Control</a></li>
<li>202104 <a href="cmudb-tree-indexes.html">CMU DB: Tree Indexes</a></li>
<li>202104 <a href="cmudb-hash-index.html">CMU DB: Hash Index</a></li>
<li>202104 <a href="firstday-ddb.html">DDB入职当天</a></li>
<li>202104 <a href="c-switch-table-in-asm.html">C语言switch表格跳转的汇编实现</a></li>
<li>202104 <a href="fast-inverse-sqrt-quake.html">快速平方根倒数(Fast Inverse Square Root)</a></li>
<li>202104 <a href="cmudb-buffer-pools.html">CMU DB: Buffer Pools</a></li>
<li>202103 <a href="cmudb-query-planning.html">CMU DB: Query Planning</a></li>
<li>202103 <a href="cmudb-database-storage.html">CMU DB: Database Storage</a></li>
<li>202103 <a href="cmudb-query-processing.html">CMU DB: Query Processing</a></li>
<li>202103 <a href="scaling-memcache-at-facebook.html">Scaling Memcache at Facebook</a> by Facebook @ 2013</li>
<li>202103 <a href="spark-rdd-paper.html">Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing</a> @ 2012</li>
<li>202103 <a href="bitcoin.html">Bitcoin: A Peer-to-Peer Electronic Cash System</a> 比特币论文</li>
<li>202103 <a href="spark-sql-paper.html">Spark SQL: Relational Data Processing in Spark</a> by Databricks @ 2015</li>
<li>202103 <a href="impala-paper.html">Impala: A Modern, Open-Source SQL Engine for Hadoop</a> @ 2015</li>
<li>202103 <a href="dremel.html">Dremel: Interactive Analysis of Web-Scale Datasets</a> @ 2010</li>
<li>202103 <a href="performance-at-top-after-moore-law.html">There’s plenty of room at the Top: What will drive computer performance after Moore’s law?</a> @ 2020</li>
<li>202103 <a href="how-to-learn-in-systematic-way.html">《不可能的技艺》4：超人怎样学</a> by 《精英日课》 万维钢</li>
<li>202103 <a href="youtube-procella.html">Procella: Unifying serving and analytical data at YouTube</a> by Google @ 2019</li>
<li>202103 <a href="apache-kudu-paper.html">Kudu: Storage for Fast Analytics on Fast Data</a> @ 2015</li>
<li>202103 <a href="google-mesa.html">Mesa: Geo-Replicated, Near Real-Time, Scalable Data Warehousing</a> by Google @ 2014</li>
<li>202102 <a href="why-we-think-when-we-have-search-engine.html">搜索引擎很强大，还需要自己思考答案吗？</a> by 吴军《硅谷来信》</li>
<li>202102 <a href="the-almanack-of-naval-ravikant.html">The Almanack of Naval Ravikant</a></li>
<li>202102 <a href="the-simplest-things-in-investment.html">投资中最简单的事</a> by 邱国鹭</li>
<li>202102 <a href="perf-analysis-and-tuning-on-modern-cpus.html">Performance Analysis and Tuning on Modern CPUs</a></li>
<li>202102 <a href="doris-hash-index.html">Doris Hash Index 分析</a></li>
<li>202102 <a href="few-simd-code-snippets.html">SIMD代码片段分析</a></li>
<li>202101 <a href="beautiful-code.html">代码之美(Beautiful Code)</a> by Grey Wilson</li>
<li>202101 <a href="few-blogs-of-elite-course.html">近期《精英日课》的几篇文章</a> 关于苦，上瘾，代孕</li>
<li>202101 <a href="popcount-functions.html">几个PopCount的实现</a></li>
<li>202101 <a href="optimizing-software-in-cpp.html">Optimizing software in C++</a> by Agner Fog</li>
<li>202101 <a href="matrix-transpose-cache-analysis.html">矩阵转置的cache分析</a></li>
<li>202101 <a href="dont-stay-for-too-long.html">不要在一点停留太久（关于交流，优化和挑战）</a></li>
<li>202101 <a href="one-hundred-years-of-solitude.html">百年孤独(Cien años de soledad)</a> 加西亚马尔克斯 / 范晔</li>
<li>202101 <a href="certificate-transparency.html">Certificate Transparency</a> 证书透明</li>
<li>202101 <a href="spanner.html">Spanner: Google's Globally-Distributed Database</a> @ 2012</li>
<li>202101 <a href="cops-causal-consistency.html">Don’t Settle for Eventual: Scalable Causal Consistency for Wide-Area Storage with COPS</a> @ 2011</li>
<li>202101 <a href="incorrect-self-eval.html">错误的自我评价</a></li>
<li>202101 <a href="short-termer-and-long-termer.html">短期主义者和长期主义者</a> 万维刚《精英日课》</li>
<li>202101 <a href="a-man-for-all-markets.html">战胜一切市场的人(A Man for All Markest)</a> 爱德华夏普自传</li>
<li>202101 <a href="from-running-to-life.html">从跑步想到生活</a></li>
</ul>
</div>
</div>
