src/blogs.org
** 2020
- 202012 [[file:msr-farm.org][MSR FaRM: distributed transactions with consistency, availability, and performance]] @ 2015
- 202012 [[file:amazon-aurora-paper.org][Amazon Aurora: Design Considerations for High Throughput Cloud-Native Relational Databases]] @ 2017
- 202012 [[file:writing-a-simple-os-from-scratch.org][Writing a simple os from scratch]] 看了个大概没有上手
- 202012 [[file:hit-refresh.org][刷新(Hit Refresh)]]
- 202012 [[file:only-the-paranoid-survive.org][只有偏执狂才能生存]] 如何利用战略转折点(Crisis Points)
- 202012 [[file:rms-autobiography-free-as-in-freedom.org][若为自由故(Free as in Freedom)]] RMS自传
- 202012 [[file:claude-shannon-autobiography-a-mind-at-play.org][香农传(A Mind at Play)]]
- 202012 [[file:what-we-talk-about-when-we-talk-about-running.org][当我谈跑步时我谈些什么]] by 村上春树
- 202012 [[file:basic-economics.org][经济学的思维方式(Basic Economics : A Common Sense Guide to the Economy)]] by 托马斯索维尔
- 202012 [[file:the-passionate-programmer.org][我编程，我快乐(The Passionate Programmer)]] by Chad Fowler
- 202012 [[file:programmer-self-cultivation.org][程序员的自我修养]] by 陈逸鹤
- 202011 [[file:love-money-and-parenting.org][爱，金钱和孩子（Love, Money, and Parenting）]]
- 202011 [[file:forces-of-habit.org][上瘾五百年(Forces of Habit)]] by 戴维·考特莱特
- 202011 [[file:a-mathematician-plays-the-stock-market.org][数学家妙谈股市(A Mathematician Plays the Stock Market)]] by John Allen Paulos
- 202010 [[file:sre-how-google-runs-production-systems.org][SRE Google运维解密(SRE: How Google Runs Production Systems)]]
- 202010 [[file:thinking-strategically.org][策略思维(Thinking Strategically)]] by 迪克西特，奈尔伯夫
- 202010 [[file:systems-performance-enterprise-and-the-cloud.org][系统性能：企业与云计算(Systems Performance: Enterprise and the Cloud)]]
- 202010 [[file:snowflake-paper.org][The Snowflake Elastic Data Warehouse]] @ 2016
- 202010 [[file:frangipani.org][Frangipani: A Scalable Distributed File System]] @ 1997
- 202010 [[file:lz-vs-sz.org][Linearizability versus Serializability]]
- 202009 [[file:object-storage-on-craq.org][Object Storage on CRAQ]] @ 2009
- 202009 [[file:reinventing-virtualization-with-aws-nitro.org][Reinventing virtualization with the AWS Nitro System]] 用Nirto系统来改进EC2虚拟化
- 202009 [[file:gfs.org][The Google File System]] @ 2003
- 202009 [[file:mapreduce.org][MapReduce: Simplified Data Processing on Large Clusters]] @ 2004j
- 202009 [[file:zookeeper.org][ZooKeeper: Wait-free coordination for Internet-scale systems]] @ 2010
- 202009 [[file:raft.org][Raft(A consensus algorithm)]]
- 202009 [[file:words-on-linearizability.org][一小段关于linearizability的解释]] from MIT 6.824
- 202008 [[file:the-design-of-a-practical-system-for-ft-vm.org][The Design of a Practical System for Fault-Tolerant Virtual Machines]] @ 2010 支持容错的虚拟机(VMWare)
- 202007 [[file:40-tips-that-will-change-your-coding-skills-forever.org][40 Tips that will change your coding skills forever]]
- 202006 [[file:zen-and-the-arts-of-motorcycle-maintenance.org][禅与摩托车维修艺术(Zen and the Arts of Motorcycle Maintenance)]] by Robert Pirsig
- 202006 [[file:the-healthy-programmer.org][程序员健康指南(The Healthy Programmer)]] by Joe Kutner
- 202006 [[file:the-mythical-man-month.org][人月神话(The Mythical Man-Month)]] by Fred Brooks
- 202006 [[file:plai-notes.org][PLAI笔记]] Programming Langauge Application and Interpretation
- 202006 [[file:design-patterns-head-first.org][设计模式Head First]]
- 202006 [[file:spring-in-action-v3.org][Spring实战第三版]]
- 202006 [[file:bipartite-maximum-matching.org][二分图最大匹配算法]] aka. 匈牙利算法
- 202006 [[file:euler-and-fermat-little-theorem.org][欧拉定理和费马小定理]]
- 202005 [[file:sv-wangchuan-investguru-v1.org][硅谷王川电子书第一卷]] by 硅谷王川
- 202004 [[file:brainfuck-jit-compiler.org][Braifuck的JIT编译器]]
- 202004 [[file:area-of-triangle.org][计算三角形面积]] 经典算法
- 202003 [[file:klotski-or-sliding-puzzle-revised.org][华容道/滑块问题算法改进]] 使用A*算法 经典算法
- 202003 [[file:put-tree-in-array.org][把树装进数组里面]] 数据结构
- 202003 [[file:boyer-moore-majority-vote-algorithm.org][Boyer–Moore majority vote algorithm]] 如何选择序列中majority的元素
- 202003 [[file:geekbang-arch-design.org][极客时间|架构设计 文章目录]]
- 202003 [[file:micro-mu-project-overview.org][micro.mu 项目解析]]
- 202002 [[file:rolling-hash-in-two-ways.org][rolling hashsh的两种实现]]
- 202002 [[file:extended-gcd.org][使用扩展欧几里得算法求解整数二元一次不定方程]] 经典算法
- 202002 [[file:some-thoughts-from-eval-and-apply.org][来自eval/apply的启发]]
- 202001 [[file:a-guide-to-making-your-science-matter.org][A Guide to Making Your Science Matter]]
- 202001 [[file:a-better-way-to-learn-math.org][一种更好的学习数学的方式]]
- 202001 [[file:regexp-in-python.org][正则表达式的Python实现]]
- 202001 [[file:poisson-and-exp-distribution.org][泊松分布和指数分布的关系]]
- 202001 [[file:lzw-algorithm-in-python.org][LZW算法的Python实现]]
- 202001 [[file:randomness-of-random-number.org][随机数的随机性]] 问题来自 [[https://blog.codingnow.com/2007/11/random.html][云风的 BLOG: 随机数有多随机？]]
- 202001 [[file:derangement-problem.org][错排问题(derangement)]] 问题来自 [[https://blog.codingnow.com/2008/05/probability_e.html][云风的 BLOG: 会抽到自己的那张吗？]]
- 202001 [[file:serialization-and-design-tradeoff.org][序列化和设计权衡]] 摘自 [[http://zguide.zeromq.org/page:all][ZeroMQ Guide]]
- 202001 [[file:throttle-in-python.org][Throttle的Python实现]] (aka. rate-limiter)
- 202001 [[file:lottery-and-exp-dist.org][10 连抽保底的概率模型]] 问题来自 [[https://blog.codingnow.com/2017/01/exponential_distribution.html][云风的 BLOG: 10 连抽保底的概率模型]]

