html/blogs.html

<div id="outline-container-org658e18c" class="outline-2">
<h2 id="org658e18c"><span class="section-number-2">4.</span> 2020</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>202012 <a href="msr-farm.html">MSR FaRM: distributed transactions with consistency, availability, and performance</a> @ 2015</li>
<li>202012 <a href="amazon-aurora-paper.html">Amazon Aurora: Design Considerations for High Throughput Cloud-Native Relational Databases</a> @ 2017</li>
<li>202012 <a href="writing-a-simple-os-from-scratch.html">Writing a simple os from scratch</a> 看了个大概没有上手</li>
<li>202012 <a href="hit-refresh.html">刷新(Hit Refresh)</a></li>
<li>202012 <a href="only-the-paranoid-survive.html">只有偏执狂才能生存</a> 如何利用战略转折点(Crisis Points)</li>
<li>202012 <a href="rms-autobiography-free-as-in-freedom.html">若为自由故(Free as in Freedom)</a> RMS自传</li>
<li>202012 <a href="claude-shannon-autobiography-a-mind-at-play.html">香农传(A Mind at Play)</a></li>
<li>202012 <a href="what-we-talk-about-when-we-talk-about-running.html">当我谈跑步时我谈些什么</a> by 村上春树</li>
<li>202012 <a href="basic-economics.html">经济学的思维方式(Basic Economics : A Common Sense Guide to the Economy)</a> by 托马斯索维尔</li>
<li>202012 <a href="the-passionate-programmer.html">我编程，我快乐(The Passionate Programmer)</a> by Chad Fowler</li>
<li>202012 <a href="programmer-self-cultivation.html">程序员的自我修养</a> by 陈逸鹤</li>
<li>202011 <a href="love-money-and-parenting.html">爱，金钱和孩子（Love, Money, and Parenting）</a></li>
<li>202011 <a href="forces-of-habit.html">上瘾五百年(Forces of Habit)</a> by 戴维·考特莱特</li>
<li>202011 <a href="a-mathematician-plays-the-stock-market.html">数学家妙谈股市(A Mathematician Plays the Stock Market)</a> by John Allen Paulos</li>
<li>202010 <a href="sre-how-google-runs-production-systems.html">SRE Google运维解密(SRE: How Google Runs Production Systems)</a></li>
<li>202010 <a href="thinking-strategically.html">策略思维(Thinking Strategically)</a> by 迪克西特，奈尔伯夫</li>
<li>202010 <a href="systems-performance-enterprise-and-the-cloud.html">系统性能：企业与云计算(Systems Performance: Enterprise and the Cloud)</a></li>
<li>202010 <a href="snowflake-paper.html">The Snowflake Elastic Data Warehouse</a> @ 2016</li>
<li>202010 <a href="frangipani.html">Frangipani: A Scalable Distributed File System</a> @ 1997</li>
<li>202010 <a href="lz-vs-sz.html">Linearizability versus Serializability</a></li>
<li>202009 <a href="object-storage-on-craq.html">Object Storage on CRAQ</a> @ 2009</li>
<li>202009 <a href="reinventing-virtualization-with-aws-nitro.html">Reinventing virtualization with the AWS Nitro System</a> 用Nirto系统来改进EC2虚拟化</li>
<li>202009 <a href="gfs.html">The Google File System</a> @ 2003</li>
<li>202009 <a href="mapreduce.html">MapReduce: Simplified Data Processing on Large Clusters</a> @ 2004j</li>
<li>202009 <a href="zookeeper.html">ZooKeeper: Wait-free coordination for Internet-scale systems</a> @ 2010</li>
<li>202009 <a href="raft.html">Raft(A consensus algorithm)</a></li>
<li>202009 <a href="words-on-linearizability.html">一小段关于linearizability的解释</a> from MIT 6.824</li>
<li>202008 <a href="the-design-of-a-practical-system-for-ft-vm.html">The Design of a Practical System for Fault-Tolerant Virtual Machines</a> @ 2010 支持容错的虚拟机(VMWare)</li>
<li>202007 <a href="40-tips-that-will-change-your-coding-skills-forever.html">40 Tips that will change your coding skills forever</a></li>
<li>202006 <a href="zen-and-the-arts-of-motorcycle-maintenance.html">禅与摩托车维修艺术(Zen and the Arts of Motorcycle Maintenance)</a> by Robert Pirsig</li>
<li>202006 <a href="the-healthy-programmer.html">程序员健康指南(The Healthy Programmer)</a> by Joe Kutner</li>
<li>202006 <a href="the-mythical-man-month.html">人月神话(The Mythical Man-Month)</a> by Fred Brooks</li>
<li>202006 <a href="plai-notes.html">PLAI笔记</a> Programming Langauge Application and Interpretation</li>
<li>202006 <a href="design-patterns-head-first.html">设计模式Head First</a></li>
<li>202006 <a href="spring-in-action-v3.html">Spring实战第三版</a></li>
<li>202006 <a href="bipartite-maximum-matching.html">二分图最大匹配算法</a> aka. 匈牙利算法</li>
<li>202006 <a href="euler-and-fermat-little-theorem.html">欧拉定理和费马小定理</a></li>
<li>202005 <a href="sv-wangchuan-investguru-v1.html">硅谷王川电子书第一卷</a> by 硅谷王川</li>
<li>202004 <a href="brainfuck-jit-compiler.html">Braifuck的JIT编译器</a></li>
<li>202004 <a href="area-of-triangle.html">计算三角形面积</a> 经典算法</li>
<li>202003 <a href="klotski-or-sliding-puzzle-revised.html">华容道/滑块问题算法改进</a> 使用A*算法 经典算法</li>
<li>202003 <a href="put-tree-in-array.html">把树装进数组里面</a> 数据结构</li>
<li>202003 <a href="boyer-moore-majority-vote-algorithm.html">Boyer–Moore majority vote algorithm</a> 如何选择序列中majority的元素</li>
<li>202003 <a href="geekbang-arch-design.html">极客时间|架构设计 文章目录</a></li>
<li>202003 <a href="micro-mu-project-overview.html">micro.mu 项目解析</a></li>
<li>202002 <a href="rolling-hash-in-two-ways.html">rolling hashsh的两种实现</a></li>
<li>202002 <a href="extended-gcd.html">使用扩展欧几里得算法求解整数二元一次不定方程</a> 经典算法</li>
<li>202002 <a href="some-thoughts-from-eval-and-apply.html">来自eval/apply的启发</a></li>
<li>202001 <a href="a-guide-to-making-your-science-matter.html">A Guide to Making Your Science Matter</a></li>
<li>202001 <a href="a-better-way-to-learn-math.html">一种更好的学习数学的方式</a></li>
<li>202001 <a href="regexp-in-python.html">正则表达式的Python实现</a></li>
<li>202001 <a href="poisson-and-exp-distribution.html">泊松分布和指数分布的关系</a></li>
<li>202001 <a href="lzw-algorithm-in-python.html">LZW算法的Python实现</a></li>
<li>202001 <a href="randomness-of-random-number.html">随机数的随机性</a> 问题来自 <a href="https://blog.codingnow.com/2007/11/random.html">云风的 BLOG: 随机数有多随机？</a></li>
<li>202001 <a href="derangement-problem.html">错排问题(derangement)</a> 问题来自 <a href="https://blog.codingnow.com/2008/05/probability_e.html">云风的 BLOG: 会抽到自己的那张吗？</a></li>
<li>202001 <a href="serialization-and-design-tradeoff.html">序列化和设计权衡</a> 摘自 <a href="http://zguide.zeromq.org/page:all">ZeroMQ Guide</a></li>
<li>202001 <a href="throttle-in-python.html">Throttle的Python实现</a> (aka. rate-limiter)</li>
<li>202001 <a href="lottery-and-exp-dist.html">10 连抽保底的概率模型</a> 问题来自 <a href="https://blog.codingnow.com/2017/01/exponential_distribution.html">云风的 BLOG: 10 连抽保底的概率模型</a></li>
</ul>
</div>
</div>
