src/blogs.org
** 2019
- 201912 [[file:xor-doubly-linked-list.org][XOR双向链表]]
- 201912 [[file:health-comes-first.org][健康还是第一位的（记二宝的满月住院）]]
- 201912 [[file:memory-allocation-buddy-system.org][内存分配之伙伴系统]]
- 201912 [[file:have-a-baby2.org][宝宝出生了2]]
- 201911 [[file:performance-degradation-by-denormal-floating-point.org][非规格浮点数带来的性能下降]] and [[https://www.toutiao.com/a6763437360362291723][一个有趣的实验，用0.1f替换0，性能提升7倍]]
- 201911 [[file:socket-port-range-and-conn-limit.org][socket的端口范围和链接数量限制]]
- 201911 [[file:math-mul-div-sqrt-impl.org][乘法，除法，开方的简单实现]]
- 201909 [[file:little-prolog-code.org][一些Prolog代码]]
- 201909 [[file:true-quality-of-software.org][软件的真实质量]] by Joel Spolsky
- 201909 [[file:how-to-build-good-software.org][How To Build Good Software]] by [[https://www.linkedin.com/in/hongyi-li-16183230/][Li HongYi]] 李鸿毅，李显龙的儿子
- 201909 [[file:career-path-myth.org][Career Path(职业规划的迷思)]] by nullgate
- 201908 [[file:gunicorn-spawn-worker-exception.org][gunicorn spawn worker exception]]
- 201908 [[file:as-a-software-engineer-why-did-you-receive-a-promotion.org][As a software engineer, why did you receive a promotion?]]
- 201907 [[file:lua-applicaiton-programming.org][Lua Application Programming]]
- 201907 [[file:mcts-shortest-version.org][MCTS精简版代码]]
- 201907 [[file:a-star-to-find-shortest-path.org][A*算法寻求最短路]] 经典算法
- 201907 [[file:generate-maze.org][生成迷宫图]]
- 201907 [[file:alpha-beta-pruning.org][alpha-beta剪枝技术]] 经典算法
- 201907 [[file:simple-treap.org][简单的treap]] 数据结构
- 201907 [[file:splay-tree-visualization.org][伸展树(splay tree)的可视化]] 数据结构
- 201907 [[file:topsort-and-scc.org][拓扑排序和强连通分量]] 经典算法
- 201907 [[file:graph-edge-type-and-articulation-node.org][图的各种边和割点计算]] 经典算法
- 201907 [[file:redis-skip-list-impl.org][Redis跳表(skip list)实现]] 数据结构
- 201907 [[file:ford-fulkerson-network-flow-problem.org][利用Ford-Fulkerson算法求解网络流问题]] 经典算法
- 201907 [[file:ten-years-of-erlang.org][Ten Years of Erlang]]
- 201907 [[file:things-you-should-never-do-part1.org][Things You Should Never Do, Part I]] by Joel Spolsky
- 201907 [[file:iphone-charles-http-proxy-issue.org][iPhone + Charles(on Mac)的HTTP代理问题]]
- 201907 [[file:why-lisp-failed.org][Why Lisp Failed]]
- 201907 [[file:google-secret-and-linear-algebra.org][Google's Secret and Linear Algebra]]
- 201907 [[file:the-law-of-leaky-abstractions.org][The Law of Leaky Abstractions]] 抽象泄露法则 by Joel Spolsky
- 201906 [[file:stats-for-hackers.org][Statistics for Hackers]]
- 201906 [[file:church-counter.org][Church Counter(邱奇计数)]]
- 201906 [[file:binghe-blogs-notes.org][田春（冰河）日记节选]]
- 201906 [[file:alleged-rc4.org][Alleged RC4]]
- 201906 [[file:a-page-about-call-cc.org][A page about call/cc]]
- 201905 [[file:bayesian-methods-for-hackers.org][Bayesian Methods for Hackers]]
- 201905 [[file:python-thread-safe-complaint.org][Python线程安全的抱怨]]
- 201905 [[file:12-classic-mistakes.org][12个软件工程经典错误]]
- 201905 [[file:javascript-prototype-chain-tests.org][JavaScript原型链测试代码]]
- 201905 [[file:javascript-the-good-parts.org][JavaScript语言精粹]]
- 201905 [[file:joe-duffy-software-leadership-series.org][Joe Duffy's Software Leadership Series]]
- 201905 [[file:keynes-vs-hayek.org][凯恩斯大战哈耶克]]
- 201905 [[file:codehaus-manifesto.org][Codehaus宣言]]
- 201905 [[file:logrotate-conf-for-nginx.org][nginx正确的logrotate配置]]
- 201904 [[file:poission-distribution-in-bitcoin-mining.org][比特币挖矿的泊松分布问题(指数分布)]]
- 201904 [[file:image-decompression-bomb.org][图片解压缩炸弹问题(image decompression bomb)]]
- 201904 [[file:polyglot-persistence.org][Polyplot Persistence]] 混合使用各种存储系统
- 201903 [[file:lessons-learned-from-fighting-against-haze.org][我当时认为治霾这事很简单，结果走一走发现不对劲，然后恍然大悟 | 陶光远 一席第###位讲者]]
- 201903 [[file:strangler-application.org][StranglerApplication]] 扼杀者应用（如何有效安全地替换掉老的应用）
- 201903 [[file:instagram-under-the-hood.org][Instagram Under the Hood]]
- 201903 [[file:running-sentry-on-ec2.org][在AWS EC2上启动Sentry]]
- 201902 [[file:tour-of-forbidden-city-on-festival-day.org][春节逛圈故宫]]
- 201902 [[file:lucky-to-have-someone-to-share.org][能找到一个人分享是多么难得的事情]]
- 201901 [[file:instagram-engineering-3-rules-to-a-scalable-cloud-application-architecture.org][Instagram Engineering’s 3 rules to a scalable cloud application architecture]]
- 201901 [[file:geekbang-tech-and-business-cases.org][极客时间|技术与商业案例解读 文章目录]]
- 201901 [[file:geekbang-ai-internal-reference.org][极客时间|AI技术内参 文章目录]]

