html/blogs.html

<div id="outline-container-org0c95038" class="outline-2">
<h2 id="org0c95038"><span class="section-number-2">5.</span> 2019</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>201912 <a href="xor-doubly-linked-list.html">XOR双向链表</a></li>
<li>201912 <a href="health-comes-first.html">健康还是第一位的（记二宝的满月住院）</a></li>
<li>201912 <a href="memory-allocation-buddy-system.html">内存分配之伙伴系统</a></li>
<li>201912 <a href="have-a-baby2.html">宝宝出生了2</a></li>
<li>201911 <a href="performance-degradation-by-denormal-floating-point.html">非规格浮点数带来的性能下降</a> and <a href="https://www.toutiao.com/a6763437360362291723">一个有趣的实验，用0.1f替换0，性能提升7倍</a></li>
<li>201911 <a href="socket-port-range-and-conn-limit.html">socket的端口范围和链接数量限制</a></li>
<li>201911 <a href="math-mul-div-sqrt-impl.html">乘法，除法，开方的简单实现</a></li>
<li>201909 <a href="little-prolog-code.html">一些Prolog代码</a></li>
<li>201909 <a href="true-quality-of-software.html">软件的真实质量</a> by Joel Spolsky</li>
<li>201909 <a href="how-to-build-good-software.html">How To Build Good Software</a> by <a href="https://www.linkedin.com/in/hongyi-li-16183230/">Li HongYi</a> 李鸿毅，李显龙的儿子</li>
<li>201909 <a href="career-path-myth.html">Career Path(职业规划的迷思)</a> by nullgate</li>
<li>201908 <a href="gunicorn-spawn-worker-exception.html">gunicorn spawn worker exception</a></li>
<li>201908 <a href="as-a-software-engineer-why-did-you-receive-a-promotion.html">As a software engineer, why did you receive a promotion?</a></li>
<li>201907 <a href="lua-applicaiton-programming.html">Lua Application Programming</a></li>
<li>201907 <a href="mcts-shortest-version.html">MCTS精简版代码</a></li>
<li>201907 <a href="a-star-to-find-shortest-path.html">A*算法寻求最短路</a> 经典算法</li>
<li>201907 <a href="generate-maze.html">生成迷宫图</a></li>
<li>201907 <a href="alpha-beta-pruning.html">alpha-beta剪枝技术</a> 经典算法</li>
<li>201907 <a href="simple-treap.html">简单的treap</a> 数据结构</li>
<li>201907 <a href="splay-tree-visualization.html">伸展树(splay tree)的可视化</a> 数据结构</li>
<li>201907 <a href="topsort-and-scc.html">拓扑排序和强连通分量</a> 经典算法</li>
<li>201907 <a href="graph-edge-type-and-articulation-node.html">图的各种边和割点计算</a> 经典算法</li>
<li>201907 <a href="redis-skip-list-impl.html">Redis跳表(skip list)实现</a> 数据结构</li>
<li>201907 <a href="ford-fulkerson-network-flow-problem.html">利用Ford-Fulkerson算法求解网络流问题</a> 经典算法</li>
<li>201907 <a href="ten-years-of-erlang.html">Ten Years of Erlang</a></li>
<li>201907 <a href="things-you-should-never-do-part1.html">Things You Should Never Do, Part I</a> by Joel Spolsky</li>
<li>201907 <a href="iphone-charles-http-proxy-issue.html">iPhone + Charles(on Mac)的HTTP代理问题</a></li>
<li>201907 <a href="why-lisp-failed.html">Why Lisp Failed</a></li>
<li>201907 <a href="google-secret-and-linear-algebra.html">Google's Secret and Linear Algebra</a></li>
<li>201907 <a href="the-law-of-leaky-abstractions.html">The Law of Leaky Abstractions</a> 抽象泄露法则 by Joel Spolsky</li>
<li>201906 <a href="stats-for-hackers.html">Statistics for Hackers</a></li>
<li>201906 <a href="church-counter.html">Church Counter(邱奇计数)</a></li>
<li>201906 <a href="binghe-blogs-notes.html">田春（冰河）日记节选</a></li>
<li>201906 <a href="alleged-rc4.html">Alleged RC4</a></li>
<li>201906 <a href="a-page-about-call-cc.html">A page about call/cc</a></li>
<li>201905 <a href="bayesian-methods-for-hackers.html">Bayesian Methods for Hackers</a></li>
<li>201905 <a href="python-thread-safe-complaint.html">Python线程安全的抱怨</a></li>
<li>201905 <a href="12-classic-mistakes.html">12个软件工程经典错误</a></li>
<li>201905 <a href="javascript-prototype-chain-tests.html">JavaScript原型链测试代码</a></li>
<li>201905 <a href="javascript-the-good-parts.html">JavaScript语言精粹</a></li>
<li>201905 <a href="joe-duffy-software-leadership-series.html">Joe Duffy's Software Leadership Series</a></li>
<li>201905 <a href="keynes-vs-hayek.html">凯恩斯大战哈耶克</a></li>
<li>201905 <a href="codehaus-manifesto.html">Codehaus宣言</a></li>
<li>201905 <a href="logrotate-conf-for-nginx.html">nginx正确的logrotate配置</a></li>
<li>201904 <a href="poission-distribution-in-bitcoin-mining.html">比特币挖矿的泊松分布问题(指数分布)</a></li>
<li>201904 <a href="image-decompression-bomb.html">图片解压缩炸弹问题(image decompression bomb)</a></li>
<li>201904 <a href="polyglot-persistence.html">Polyplot Persistence</a> 混合使用各种存储系统</li>
<li>201903 <a href="lessons-learned-from-fighting-against-haze.html">我当时认为治霾这事很简单，结果走一走发现不对劲，然后恍然大悟 | 陶光远 一席第###位讲者</a></li>
<li>201903 <a href="strangler-application.html">StranglerApplication</a> 扼杀者应用（如何有效安全地替换掉老的应用）</li>
<li>201903 <a href="instagram-under-the-hood.html">Instagram Under the Hood</a></li>
<li>201903 <a href="running-sentry-on-ec2.html">在AWS EC2上启动Sentry</a></li>
<li>201902 <a href="tour-of-forbidden-city-on-festival-day.html">春节逛圈故宫</a></li>
<li>201902 <a href="lucky-to-have-someone-to-share.html">能找到一个人分享是多么难得的事情</a></li>
<li>201901 <a href="instagram-engineering-3-rules-to-a-scalable-cloud-application-architecture.html">Instagram Engineering’s 3 rules to a scalable cloud application architecture</a></li>
<li>201901 <a href="geekbang-tech-and-business-cases.html">极客时间|技术与商业案例解读 文章目录</a></li>
<li>201901 <a href="geekbang-ai-internal-reference.html">极客时间|AI技术内参 文章目录</a></li>
</ul>
</div>
</div>
