src/blogs.org
** 2018
- 201812 [[file:geekbang-recommender-system.org][极客时间|推荐系统36式 文章目录]]
- 201812 [[file:geekbang-tech-management-class.org][极客时间|朱赟的技术管理课 文章目录]]
- 201812 [[file:nginx-log-parser-opt.org][nginx日志解析器优化]]
- 201812 [[file:geekbang-tech-management-practice.org][极客时间|技术管理实战36讲 文章目录]]
- 201812 [[file:geekbang-mysql-practice.org][极客时间|MySQL实战45讲 文章目录]]
- 201811 [[file:why-i-quit-google-to-work-for-myself.org][Why I Quit Google to Work for Myself]]
- 201811 [[file:whats-the-largest-amount-of-bad-code-you-have-ever-seen-work.org][{Ask HN}What's the largest amount of bad code you have ever seen work?]]
- 201811 [[file:interview-with-gmail-creator-and-y-combinator-partner-paul-buchheit.org][Interview with Gmail Creator Paul Buchheit]]
- 201811 [[file:the-economics-of-getting-hired-as-a-data-scientist.org][The economics of getting hired as a data scientist]]
- 201811 [[file:keras-author-on-software-engineering.org][Keras之父写给年轻程序员的33条忠告]]
- 201810 [[file:writing-system-software-code-comments.org][Writing system software: code comments]]
- 201810 [[file:github-flow.org][GitHub Flow]]
- 201810 [[file:fallacies-of-distributed-computing-explained.org][Fallacies of Distributed Computing Explained]]
- 201810 [[file:whats-a-senior-engineers-job.org][What's a senior engineer's job?]]
- 201810 [[file:geekbang-coolshell-index.org][极客时间|左耳听风 文章目录]]
- 201810 [[file:living-in-county.org][深度好文：混在县城]]
- 201810 [[file:avoiding-burnout.org][Avoiding burnout: lessons learned from a 19th century philosopher]]
- 201810 [[file:pros-and-cons-in-tech-monopoly.org][去大公司的各种考虑]]
- 201810 [[file:find-lca-using-rmq.org][Find LCA using RMQ]]
- 201810 [[file:sudoku-solving.org][数独程序求解(Sudoku)]] 经典算法
- 201809 [[file:segment-tree-for-rmq.org][求解RMQ的线段树实现]] 数据结构
- 201809 [[file:klotski-solving.org][华容道程序求解]] (klotski / sliding-puzzle)
- 201809 [[file:configure-topcoder-env.org][配置TopCoder环境]]
- 201808 [[file:etsy-activity-feeds-architecture.org][Etsy Activity Feeds Architecture]]
- 201808 [[file:protobuf-encoding.org][Protobuf Encoding]] Protobuf编码方式
- 201808 [[file:youtube-scalability.org][YouTube Scalability]] on youtube
- 201808 [[file:sit-boost-your-tech-career.org][SIT / Boost your tech career]]
- 201807 [[file:algorithm-design-steps-in-interview.org][如何进行算法设计面试]] in Hired in Tech
- 201807 [[file:system-design-steps-in-interview.org][如何进行系统设计面试]] in Hired in Tech
- 201807 [[file:lang-detect-and-encoding-detect.org][语言检测和编码检测]] 一种利用语言检测来做编码检测的可能方法
- 201807 [[file:aws-overview.org][AWS Overview]] 官方给出的AWS各种产品介绍，比我简单抓取的 [[file:aws-products.org][AWS Products]] 要好
- 201807 [[file:amazon-dynamodb.org][Amazon DynamoDB]] All Things Distributed
- 201807 [[file:5-lessons-we-have-learned-using-aws.org][5 Lessons We’ve Learned Using AWS]] Netflix TechBlog
- 201807 [[file:how-to-write-a-good-software-design-doc.org][How to write a good software design doc]]
- 201807 [[file:oh-i-have-seen-this-idea-before.org][oh, I’ve seen this idea before]] 如何回答这个问题
- 201806 [[file:aws-products.org][AWS Products]]
- 201806 [[file:binary-indexed-tree.org][Binary Indexed Tree(Fenwick Tree)]] 数据结构
- 201806 [[file:interview-psychological-tricks.org][面试心理技巧(Psychological Tricks)]]
- 201805 [[file:write-the-code-for-run.org][为运行而生的代码]]
- 201805 [[file:an-impact-guide-for-engineers.org][An Impact Guide for Engineers]] 工程师影响力指南
- 201805 [[file:config-cuda-env-on-linux.org][在Linux上配置CUDA环境]]
- 201805 [[file:types-of-scipy-sparse-matrix.org][scipy几种稀疏矩阵表示]]
- 201805 [[file:tibet-travel.org][西藏(林芝-波密-拉萨)游记]]
- 201805 [[file:skin-in-the-game-dedao.org][精英日课解读《利益悠关》]] 摘自得到的《精英日课》
- 201805 [[file:mastering-study.org][寻常问题的精英解法-如何学习]] 摘自得到的《精英日课》
- 201805 [[file:why-turing-is-master.org][计算机领域大人物：艾伦·图灵牛在哪？]] 摘自得到的《硅谷来信》
- 201805 [[file:why-study-history.org][为什么学习历史]] 摘自得到的《硅谷来信》
- 201804 [[file:ssh-proxycommand-on-ssr.org][ssh proxycommand on ssr]]
- 201804 [[file:getting-started-elk-beat.org][搭建ELK + Beat(用于日志收集和指标收集)]]
- 201803 [[file:nginx-https-redirect-loop.org][nginx的https重定向循环问题]]
- 201803 [[file:what-habits-make-a-programmer-great.org][What habits make a programmer great?]] about meta-habit
- 201803 [[file:how-to-build-your-own-alpha-zero-ai.org][How to build your own AlphaZero AI using Python and Keras]]
- 201803 [[file:on-being-a-senior-engineer.org][On Being A Senior Engineer]]
- 201803 [[file:how-the-economic-machine-works-by-ray-dalio.org][How The Economic Machine Works By Ray Dalio]] 经济机器是如何运行的
- 201802 [[file:difference-between-poor-rich-on-zhihu.org][你在哪一刻体验到了真正的贫富差距？]] 摘自知乎回答
- 201802 [[file:python-weak-perf-matters.org][Python 的低性能问题是无法忽视的]]
- 201802 [[file:management-actually-is-engineering.org][管理其实是个工程学]] 摘自得到的《精英日课》
- 201801 [[file:websocket-and-socketio.org][WebSocket和Socket.IO]]
- 201801 [[file:intro-quantum-computing.org][量子计算机初探]]
- 201801 [[file:wechat-auto-jump.org][微信跳一跳的自动化]]
- 201801 [[file:python-requests-encoding-issue.org][Python Requests库编码问题]]
- 201801 [[file:minimal-wsgi-app-in-python.org][Minimal WSGI App in Pyton]]
- 201801 [[file:reading-excel-in-python.org][Reading Excel in Python]]
- 201801 [[file:find-10-digits-prime-in-consecutive-digits-of-e.org][Find 10 digits prime in consecutive digits of e]]
- 201801 [[file:26-lessons-from-being-a-developer-at-a-startup.org][26 Lessons From Being a Developer at a Startup]]

