src/blogs.org
** 2017
- 201712 [[file:scaling-the-gitlab-database.org][Scaling the GitLab Database]]
- 201712 [[file:geoffrey-hinton-interview-in-coursera.org][Geoffrey Hinton Interview in Coursera]]
- 201712 [[file:cities-and-ambition.org][市井雄心 Cities and Ambition]] by Paul Graham
- 201712 [[file:math-read.org][How to Read Mathematics]]
- 201712 [[file:find-which-process-use-tcp-port.org][查找TCP端口被哪个进程占用]]
- 201712 [[file:shaodowsocks-under-kcptun.org][shadowsocksr + kcptun]]
- 201712 [[file:make-a-workable-dns.org][搭建一个可用的DNS]] (dnsmasq + ss)
- 201712 [[file:the-language-of-the-system.org][The Language of the System]] by Rich Hickey
- 201712 [[file:love-your-bugs.org][Love Your Bugs]]
- 201712 [[file:code-in-space.org][Code in Space]] 太空系统环境下的编程
- 201712 [[file:timeline-at-scale-in-twitter.org][Timeline at Scale in Twitter]] by Raffi Krikorian
- 201712 [[file:simple-made-easy.org][Simple Made Easy]] by Rich Hickey
- 201712 [[file:probability-paradox-by-peter-norvig.org][Probability Paradox by Norvig]] Norvig写的一篇关于概率和悖论文章
- 201712 [[file:ways-of-paying-mortgage.org][等额本金和等额本息的计算]]
- 201712 [[file:nobody-ever-got-fired-for-buying-a-cluster.org][Nobody ever got fired for buying a cluster]] 计算集群的必要性思考 @ 2013
- 201712 [[file:sonos-streaming-basics.org][流媒体基础知识(sonos)]]
- 201711 [[file:ten-rules-for-negotiating-a-job-offer.org][Ten Rules for Negotiating a Job Offer]]
- 201711 [[file:tool-is-to-free-people.org][解放生产力的工具]]
- 201711 [[file:software-2.org][Software 2.0]] by Andrej Karpathy
- 201711 [[file:getting-real-about-distributed-system-reliability.org][Getting Real About Distributed System Reliability]]
- 201711 [[file:pypy-impl.org][PyPy实现方式]]
- 201710 [[file:few-tips-of-mongodb-best-practice.org][一些MongoDB的实践建议]]
- 201710 [[file:mongodb34-perf-issue-checkpoint.org][升级到MongoDB 3.4出现的性能问题]]
- 201710 [[file:make-startup-usb-stick-under-mac.org][在Mac下面制作USB启动盘]]
- 201709 [[file:patch-oriented-software-development.org][补丁式的软件开发方法]]
- 201709 [[file:how-to-build-your-personal-brand-as-a-new-developer.org][How to build your personal brand as a new developer]]
- 201709 [[file:narrow-python-build.org][Narrow Python Build]]
- 201708 [[file:barely-friend-and-close-friend.org][朋友，益友，狐朋狗友]]
- 201708 [[file:pain-think-and-change.org][痛苦，思考，改变]]
- 201708 [[file:good-to-have-slack-time.org][珍惜空余时间]]
- 201708 [[file:the-feynman-technique-the-best-way-to-learn-anything.org][The Feynman Technique: The Best Way to Learn Anything]]
- 201707 [[file:scaling-to-billions-on-top-of-digital-ocean.org][Scaling to Billions on Top of DigitalOcean]]
- 201707 [[file:search-at-slack.org][Search at Slack]] Slack在搜索排序方面的工作
- 201707 [[file:why-did-so-many-startups-choose-nosql.org][Why Did So Many Startups Choose NoSQL?]]
- 201707 [[file:macosx-rootless-mode.org][MacOS X Rootless Mode]]
- 201707 [[file:what-you-can-do-and-what-you-should-do.org][能做什么和该做什么]]
- 201707 [[file:reducing-image-file-size-at-esty.org][Reducing Image File Size at Etsy]]
- 201707 [[file:making-photos-smaller.org][Making Photos Smaller Without Quality Loss]]
- 201707 [[file:proxy-on-http-streaming.org][HTTP流媒体的代理实现]]
- 201707 [[file:ssh-permission-denied.org][SSH Permission Denied(Public Key)]]
- 201706 [[file:the-evolution-of-code-deploys-at-reddit.org][The Evolution of Code Deploys at Reddit]]
- 201706 [[file:on-python-profiling.org][Python程序性能分析]]
- 201706 [[file:44-eng-mag-lessons.org][44 engineering management lessons]]
- 201706 [[file:use-emacs-org-mode-to-build-site.org][用Emacs Org-Mode来建站]]
- 201705 [[file:colleague-creates-spaghetti-code.org][What to do when Your Colleague Creates Spaghetti Code]]
- 201705 [[file:how-yelp-runs-millions-of-tests-every-day.org][How Yelp Runs Millions of Tests Every Day]]
- 201705 [[file:ssh-tunneling-python.org][SSH Tunneling in Python]]
- 201705 [[file:issue-of-retry-after-field.org][Retry-After字段带来的问题]]
- 201705 [[file:wujun-thoughts-on-career.org][职场上的四个误区和四个破法]] 摘自得到的《硅谷来信》
- 201705 [[file:use-wifi-aps-to-identify-location.org][利用WiFi热点来定位]]
- 201704 [[file:intrust-from-leadership.org][切身感受到的危机（领导的不信任）]]
- 201704 [[file:u-of-t-professor-geoffrey-hiton.org][U of T, Geoffrey Hinton]] 一篇关于Geoffrey Hiton的文章
- 201704 [[file:scaling-your-api-with-rate-limiters.org][Scaling your API with rate limiters]]
- 201704 [[file:a-few-days-at-village.org][在老家的几天]]
- 201703 [[file:software-engineering-at-google.org][Software Engineering at Google]] by Fergus Henderson
- 201703 [[file:a-possible-impl-of-reco-sys.org][推荐系统的可能实现]]
- 201703 [[file:automation-on-finacial-report.org][实事求是谈金融报告自动化 – 文因互联]]
- 201702 [[file:boost-shadowsocks-with-tcp-bbr.org][通过TCP BBR为ShadowSocks加速]]
- 201702 [[file:principle-of-smart-route-in-vpn.org][VPN的智能加速原理]]
- 201702 [[file:my-thoughts-on-startup.org][创业/小公司的优点和缺点]]
- 201702 [[file:abandoned-probabilistic-option.org][被放弃的概率权]]
- 201701 [[file:boots-of-spanish-leather.org][Boots of Spanish Leather]] by Bob Dylan
- 201701 [[file:is-there-a-simple-algorithm-for-intelligence.org][Is there a simple algorithm for intelligence?]] By Michael Nielsen
- 201701 [[file:on-the-future-of-neural-networks.org][On the future of neural networks]] By Michael Nielsen
- 201701 [[file:on-stories-in-neural-networks.org][On stories in neural networks]] By Michael Nielsen

