html/blogs.html

<div id="outline-container-org362c999" class="outline-2">
<h2 id="org362c999"><span class="section-number-2">7.</span> 2017</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>201712 <a href="scaling-the-gitlab-database.html">Scaling the GitLab Database</a></li>
<li>201712 <a href="geoffrey-hinton-interview-in-coursera.html">Geoffrey Hinton Interview in Coursera</a></li>
<li>201712 <a href="cities-and-ambition.html">市井雄心 Cities and Ambition</a> by Paul Graham</li>
<li>201712 <a href="math-read.html">How to Read Mathematics</a></li>
<li>201712 <a href="find-which-process-use-tcp-port.html">查找TCP端口被哪个进程占用</a></li>
<li>201712 <a href="shaodowsocks-under-kcptun.html">shadowsocksr + kcptun</a></li>
<li>201712 <a href="make-a-workable-dns.html">搭建一个可用的DNS</a> (dnsmasq + ss)</li>
<li>201712 <a href="the-language-of-the-system.html">The Language of the System</a> by Rich Hickey</li>
<li>201712 <a href="love-your-bugs.html">Love Your Bugs</a></li>
<li>201712 <a href="code-in-space.html">Code in Space</a> 太空系统环境下的编程</li>
<li>201712 <a href="timeline-at-scale-in-twitter.html">Timeline at Scale in Twitter</a> by Raffi Krikorian</li>
<li>201712 <a href="simple-made-easy.html">Simple Made Easy</a> by Rich Hickey</li>
<li>201712 <a href="probability-paradox-by-peter-norvig.html">Probability Paradox by Norvig</a> Norvig写的一篇关于概率和悖论文章</li>
<li>201712 <a href="ways-of-paying-mortgage.html">等额本金和等额本息的计算</a></li>
<li>201712 <a href="nobody-ever-got-fired-for-buying-a-cluster.html">Nobody ever got fired for buying a cluster</a> 计算集群的必要性思考 @ 2013</li>
<li>201712 <a href="sonos-streaming-basics.html">流媒体基础知识(sonos)</a></li>
<li>201711 <a href="ten-rules-for-negotiating-a-job-offer.html">Ten Rules for Negotiating a Job Offer</a></li>
<li>201711 <a href="tool-is-to-free-people.html">解放生产力的工具</a></li>
<li>201711 <a href="software-2.html">Software 2.0</a> by Andrej Karpathy</li>
<li>201711 <a href="getting-real-about-distributed-system-reliability.html">Getting Real About Distributed System Reliability</a></li>
<li>201711 <a href="pypy-impl.html">PyPy实现方式</a></li>
<li>201710 <a href="few-tips-of-mongodb-best-practice.html">一些MongoDB的实践建议</a></li>
<li>201710 <a href="mongodb34-perf-issue-checkpoint.html">升级到MongoDB 3.4出现的性能问题</a></li>
<li>201710 <a href="make-startup-usb-stick-under-mac.html">在Mac下面制作USB启动盘</a></li>
<li>201709 <a href="patch-oriented-software-development.html">补丁式的软件开发方法</a></li>
<li>201709 <a href="how-to-build-your-personal-brand-as-a-new-developer.html">How to build your personal brand as a new developer</a></li>
<li>201709 <a href="narrow-python-build.html">Narrow Python Build</a></li>
<li>201708 <a href="barely-friend-and-close-friend.html">朋友，益友，狐朋狗友</a></li>
<li>201708 <a href="pain-think-and-change.html">痛苦，思考，改变</a></li>
<li>201708 <a href="good-to-have-slack-time.html">珍惜空余时间</a></li>
<li>201708 <a href="the-feynman-technique-the-best-way-to-learn-anything.html">The Feynman Technique: The Best Way to Learn Anything</a></li>
<li>201707 <a href="scaling-to-billions-on-top-of-digital-ocean.html">Scaling to Billions on Top of DigitalOcean</a></li>
<li>201707 <a href="search-at-slack.html">Search at Slack</a> Slack在搜索排序方面的工作</li>
<li>201707 <a href="why-did-so-many-startups-choose-nosql.html">Why Did So Many Startups Choose NoSQL?</a></li>
<li>201707 <a href="macosx-rootless-mode.html">MacOS X Rootless Mode</a></li>
<li>201707 <a href="what-you-can-do-and-what-you-should-do.html">能做什么和该做什么</a></li>
<li>201707 <a href="reducing-image-file-size-at-esty.html">Reducing Image File Size at Etsy</a></li>
<li>201707 <a href="making-photos-smaller.html">Making Photos Smaller Without Quality Loss</a></li>
<li>201707 <a href="proxy-on-http-streaming.html">HTTP流媒体的代理实现</a></li>
<li>201707 <a href="ssh-permission-denied.html">SSH Permission Denied(Public Key)</a></li>
<li>201706 <a href="the-evolution-of-code-deploys-at-reddit.html">The Evolution of Code Deploys at Reddit</a></li>
<li>201706 <a href="on-python-profiling.html">Python程序性能分析</a></li>
<li>201706 <a href="44-eng-mag-lessons.html">44 engineering management lessons</a></li>
<li>201706 <a href="use-emacs-org-mode-to-build-site.html">用Emacs Org-Mode来建站</a></li>
<li>201705 <a href="colleague-creates-spaghetti-code.html">What to do when Your Colleague Creates Spaghetti Code</a></li>
<li>201705 <a href="how-yelp-runs-millions-of-tests-every-day.html">How Yelp Runs Millions of Tests Every Day</a></li>
<li>201705 <a href="ssh-tunneling-python.html">SSH Tunneling in Python</a></li>
<li>201705 <a href="issue-of-retry-after-field.html">Retry-After字段带来的问题</a></li>
<li>201705 <a href="wujun-thoughts-on-career.html">职场上的四个误区和四个破法</a> 摘自得到的《硅谷来信》</li>
<li>201705 <a href="use-wifi-aps-to-identify-location.html">利用WiFi热点来定位</a></li>
<li>201704 <a href="intrust-from-leadership.html">切身感受到的危机（领导的不信任）</a></li>
<li>201704 <a href="u-of-t-professor-geoffrey-hiton.html">U of T, Geoffrey Hinton</a> 一篇关于Geoffrey Hiton的文章</li>
<li>201704 <a href="scaling-your-api-with-rate-limiters.html">Scaling your API with rate limiters</a></li>
<li>201704 <a href="a-few-days-at-village.html">在老家的几天</a></li>
<li>201703 <a href="software-engineering-at-google.html">Software Engineering at Google</a> by Fergus Henderson</li>
<li>201703 <a href="a-possible-impl-of-reco-sys.html">推荐系统的可能实现</a></li>
<li>201703 <a href="automation-on-finacial-report.html">实事求是谈金融报告自动化 – 文因互联</a></li>
<li>201702 <a href="boost-shadowsocks-with-tcp-bbr.html">通过TCP BBR为ShadowSocks加速</a></li>
<li>201702 <a href="principle-of-smart-route-in-vpn.html">VPN的智能加速原理</a></li>
<li>201702 <a href="my-thoughts-on-startup.html">创业/小公司的优点和缺点</a></li>
<li>201702 <a href="abandoned-probabilistic-option.html">被放弃的概率权</a></li>
<li>201701 <a href="boots-of-spanish-leather.html">Boots of Spanish Leather</a> by Bob Dylan</li>
<li>201701 <a href="is-there-a-simple-algorithm-for-intelligence.html">Is there a simple algorithm for intelligence?</a> By Michael Nielsen</li>
<li>201701 <a href="on-the-future-of-neural-networks.html">On the future of neural networks</a> By Michael Nielsen</li>
<li>201701 <a href="on-stories-in-neural-networks.html">On stories in neural networks</a> By Michael Nielsen</li>
</ul>
</div>
</div>
