html/blogs.html

<div id="outline-container-org925c75c" class="outline-2">
<h2 id="org925c75c"><span class="section-number-2">9.</span> 2015</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>201512 <a href="ms-presentation.html">Michael Stonebraker Presentation</a></li>
<li>201512 <a href="how-to-launch-a-mac-app-and-become-1-top-paid-app-globally.html">How To Launch a Mac App and Become #1 Top Paid App Globally</a></li>
<li>201512 <a href="what-would-it-take-to-prove-me-wrong.html">What would it take to prove me wrong?</a></li>
<li>201512 <a href="a-great-developer-can-come-from-anywhere.html">A great developer can come from anywhere</a></li>
<li>201512 <a href="employee-equity.html">Employee Equity</a> Sam Altman关于员工期权的文章.</li>
<li>201512 <a href="before-you-code-write.html">Before you code, write.</a></li>
<li>201512 <a href="remove-the-stress-pick-a-deadline.html">Remove the stress, pick a deadline</a></li>
<li>201512 <a href="the-secret-to-career-success.html">The Secret to Career Success</a></li>
<li>201512 <a href="the-scientist.html">The Scientist</a></li>
<li>201511 <a href="ios-device-and-screenshot-size.html">iOS设备与屏幕分辨率对应关系</a></li>
<li>201511 <a href="a-note-of-nobel-winner.html">石墨烯教父: 从千年博后到物理诺奖的心路历程</a></li>
<li>201511 <a href="why-i-stopped-paying-attention-to-industry-news.html">Why I stopped paying attention to industry news</a></li>
<li>201510 <a href="learn-stop-using-shiny-new-things-and-love-mysql.html">Learn to stop using shiny new things and love MySQL</a></li>
<li>201510 <a href="climbing-the-wrong-hill.html">Climbing The Wrong Hill</a></li>
<li>201510 <a href="lessons-learned-writing-highly-available-code.html">Lessons learned writing highly available code</a></li>
<li>201510 <a href="dont-base-your-business-on-a-paid-app.html">Don't base your business on a paid app</a></li>
<li>201510 <a href="some-advice-from-jeff-bezos.html">Some advice from Jeff Bezos</a></li>
<li>201510 <a href="ten-rules-for-open-source-success.html">Ten Rules for Open Source Success</a></li>
<li>201510 <a href="competitors-are-not-the-enemy.html">Competitors Are Not The Enemy</a></li>
<li>201510 <a href="making-money-along-the-way.html">Making money along the way</a></li>
<li>201510 <a href="staying-healthy-while-working-remotely.html">远程工作者如何保持健康</a></li>
<li>201510 <a href="real-life-of-startup-with-baby.html">带着娃创业的真实一面</a></li>
<li>201510 <a href="a-impl-of-my-dict-book.html">一个生词本的实现</a></li>
<li>201510 <a href="chasing-the-shiny-and-new.html">chasing the shiny and new (追逐时髦的技术)</a></li>
<li>201510 <a href="why-cd-just-keeps-on-giving.html">Why Continuous Deployment just keeps on giving</a></li>
<li>201510 <a href="how-to-get-a-job-like-mine-aaron-swartz.html">Aaron Swartz: How to Get a Job Like Mine</a></li>
<li>201510 <a href="a-decade-at-google.html">A Decade at Google</a></li>
<li>201510 <a href="dont-switch-to-yinxiang-note.html">切换到印象笔记-NO!</a></li>
<li>201509 <a href="ostep-persist-file.html">OSTEP / Persistence-File</a></li>
<li>201509 <a href="ostep-persist-disk.html">OSTEP / Persistence-Disk</a></li>
<li>201509 <a href="ostep-con-cv.html">OSTEP / Concurrency-CV</a></li>
<li>201509 <a href="ostep-con-lock.html">OSTEP / Concurrency-Lock</a></li>
<li>201509 <a href="hive-getting-started.html">hive getting started</a></li>
<li>201509 <a href="zookeeper-getting-started.html">zookeeper getting started</a></li>
<li>201509 <a href="ostep-virt-vax-vms.html">OSTEP / Virt-VAX/VMS</a></li>
<li>201509 <a href="ostep-virt-vm-page.html">OSTEP / Virt-页式系统</a></li>
<li>201509 <a href="ostep-virt-vm-seg.html">OSTEP / Virt-段式系统</a></li>
<li>201509 <a href="ostep-virt-cpu.html">OSTEP / Virt-CPU</a></li>
<li>201509 <a href="ostep-readings.html">OSTEP / Readings</a></li>
<li>201509 <a href="a-love-for-legacy.html">A Love for Legacy</a></li>
<li>201509 <a href="availability-vs-durability.html">Availability vs. Durability</a></li>
<li>201509 <a href="2pc-vs-paxos.html">2PC vs. Paxos</a></li>
<li>201509 <a href="central-limit-theorem.html">中心极限定理</a></li>
<li>201509 <a href="spark-master-ui.html">spark master ui</a></li>
<li>201509 <a href="what-happens-to-older-developers.html">What Happens to Older Developers?</a></li>
<li>201509 <a href="tips-for-work-life-balance.html">Tips for work-life balance</a></li>
<li>201509 <a href="start-from-simple.html">start from simple</a></li>
<li>201508 <a href="you-know-so-little.html">其实你知道的太少</a></li>
<li>201507 <a href="have-a-baby.html">宝宝出生了</a></li>
<li>201505 <a href="equipped-with-ssd.html">装配SSD</a></li>
<li>201504 <a href="kaggle-facial-keypoints-detection.html">Kaggle Facial Keypoints Detection</a></li>
<li>201504 <a href="kaggle-digit-recongnizer.html">Kaggle Digit Recognizer</a></li>
<li>201504 <a href="life-is-not-easy-but-magical.html">life is not easy but magical</a></li>
<li>201503 <a href="how-to-do-cross-validation.html">如何做cross validation</a></li>
<li>201503 <a href="kaggle-bike-sharing-demand.html">Kaggle Bike Sharing Demand</a></li>
<li>201503 <a href="principle-of-alloc-time-for-work.html">分配工作时间的准则</a></li>
<li>201502 <a href="how-to-choose-baseline.html">选用什么方法做baseline</a></li>
<li>201502 <a href="2015-house-clean.html">2015年初家庭大扫除</a></li>
<li>201502 <a href="do-house-work-as-leisure.html">有空多干点家务活</a></li>
<li>201502 <a href="you-cant-read-all-books.html">书是读不过来的</a></li>
<li>201502 <a href="peter-thiel-on-competition-obsession.html">Peter Thiel 谈竞争沉迷</a></li>
<li>201502 <a href="telstra-billboard-of-love.html">Telstra BB</a></li>
</ul>
</div>
</div>
